[
  {"id":"10HemiacetalsHemiketals2018","abstract":"One of the most important examples of a nucleophilic addition reaction in biochemistry, and in carbohydrate chemistry in particular, is the addition of an alcohol to a ketone or aldehyde. When an …","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"10HemiacetalsHemiketals2018","container-title":"Chemistry LibreTexts","issued":{"date-parts":[[2018,8,10]]},"language":"en","title":"10.3: Hemiacetals, Hemiketals, and Hydrates","title-short":"10.3","type":"webpage","URL":"https://chem.libretexts.org/Bookshelves/Organic_Chemistry/Book%3A_Organic_Chemistry_with_a_Biological_Emphasis_v2.0_(Soderberg)/10%3A_Nucleophilic_Carbonyl_Addition_Reactions/10.03%3A_Hemiacetals_Hemiketals_and_Hydrates"},
  {"id":"14DehydrationReactions2016","abstract":"Alcohols can form alkenes via the E1 or E2 pathway depending on the structure of the alcohol and the reaction conditions.&nbsp; Markovnokov's Rule still applies and carbocation rearrangements must be …","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"14DehydrationReactions2016","container-title":"Chemistry LibreTexts","issued":{"date-parts":[[2016,2,9]]},"language":"en","title":"14.4: Dehydration Reactions of Alcohols","title-short":"14.4","type":"webpage","URL":"https://chem.libretexts.org/Bookshelves/Organic_Chemistry/Map%3A_Organic_Chemistry_(Wade)/14%3A_Reactions_of_Alcohols/14.04%3A_Dehydration_Reactions_of_Alcohols"},
  {"id":"Acetal2022","abstract":"An acetal is a functional group with the connectivity R2C(OR')2). Here, the R groups can be organic fragments (a carbon atom, with arbitrary other atoms attached to that) or hydrogen, while the R' groups must be organic fragments not hydrogen. The two R' groups can be equivalent to each other (a \"symmetric acetal\") or not (a \"mixed acetal\"). Acetals are formed from and convertible to aldehydes or ketones and have the same oxidation state at the central carbon, but have substantially different chemical stability and reactivity as compared to the analogous carbonyl compounds. The central carbon atom has four bonds to it, and is therefore saturated and has tetrahedral geometry.\nThe term ketal is sometimes used to identify structures associated with ketones (both R groups organic fragments rather than hydrogen) rather than aldehydes and, historically, the term acetal was used specifically for the aldehyde-related cases (having at least one hydrogen in place of an R on the central carbon).  The IUPAC originally deprecated the usage of the word ketal altogether, but has since reversed its decision.  However, in contrast to historical usage, ketals are now a subset of acetals, a term that now encompasses both aldehyde- and ketone-derived structures.\nIf one of the R groups has an oxygen as the first atom (that is, there are more than two oxygens single-bonded to the central carbon), the functional group is instead an orthoester. In contrast to variations of R, both R' groups are organic fragments. If one R' is a hydrogen, the functional group is instead a hemiacetal, while if both are H, the functional group is a ketone hydrate or aldehyde hydrate.\nFormation of an acetal occurs when the hydroxyl group of a hemiacetal becomes protonated and is lost as water. The carbocation that is produced is then rapidly attacked by a molecule of alcohol. Loss of the proton from the attached alcohol gives the acetal.\n\nAcetals are stable compared to hemiacetals but their formation is a reversible equilibrium as with esters. As a reaction to create an acetal proceeds, water must be removed from the reaction mixture, for example, with a Dean–Stark apparatus, lest it hydrolyse the product back to the hemiacetal. The formation of acetals reduces the total number of molecules present (carbonyl + 2 alcohol → acetal + water) and therefore is generally not favourable with regards to entropy. One situation where it is not entropically unfavourable is when a single diol molecule is used rather than two separate alcohol molecules (carbonyl + diol → acetal + water). Another way to avoid the entropic cost is to perform the synthesis by acetal exchange, using a pre-existing acetal-type reagent as the OR'-group donor rather than simple addition of alcohols themselves. One type of reagent used for this method is an orthoester. In this case, water produced along with the acetal product is destroyed when it hydrolyses residual orthoester molecules, and this side reaction also produces more alcohol to be used in the main reaction.\nAcetals are used as protecting groups for carbonyl groups in organic synthesis because they are stable with respect to hydrolysis by bases and with respect to many oxidizing and reducing agents. They can either protect the carbonyl in a molecule (by temporarily reacting it with an alcohol) or a diol (by temporarily reacting it with a carbonyl). That is, either the carbonyl, or the alcohols, or both could be part of the molecule whose reactivity is to be controlled.\nVarious specific carbonyl compounds have special names for their acetal forms. For example, an acetal formed from formaldehyde (two hydrogens attached to the central carbon) is sometimes called a formal or the methylenedioxy group. The acetal formed from acetone is sometimes called an acetonide.\nUsed in a more general sense, the term X,Y-acetal also refers to any functional group that consists of a carbon bearing two heteroatoms X and Y.  For example, N,O-acetal refers to compounds of type R1R2C(OR)(NR'2) (R,R' ≠ H) also known as a hemiaminal ether) and S,S-acetal refers to compounds of type R1R2C(SR)(SR') (R,R' ≠ H, also known as a thioacetal).","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Acetal2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,1,5]]},"language":"en","note":"Page Version ID: 1063866474","source":"Wikipedia","title":"Acetal","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Acetal&oldid=1063866474"},
  {"id":"AcetylCoA2022","abstract":"Acetyl-CoA (acetyl coenzyme A) is a molecule that participates in many biochemical reactions in protein, carbohydrate and lipid metabolism. Its main function is to deliver the acetyl group to the citric acid cycle (Krebs cycle) to be oxidized for energy production. Coenzyme A (CoASH or CoA) consists of a β-mercaptoethylamine group linked to the vitamin pantothenic acid (B5) through an amide linkage and 3'-phosphorylated ADP. The acetyl group (indicated in blue in the structural diagram on the right) of acetyl-CoA is linked to the sulfhydryl substituent of the β-mercaptoethylamine group. This thioester linkage is a \"high energy\" bond, which is particularly reactive. Hydrolysis of the thioester bond is exergonic (−31.5 kJ/mol).\nCoA is acetylated to acetyl-CoA by the breakdown of carbohydrates through glycolysis and by the breakdown of fatty acids through β-oxidation. Acetyl-CoA then enters the citric acid cycle, where the acetyl group is oxidized to carbon dioxide and water, and the energy released is captured in the form of 11 ATP and one GTP per acetyl group. GTP is the equivalent of ATP and they can be interconverted by Nucleoside-diphosphate kinase.Konrad Bloch and Feodor Lynen were awarded the 1964 Nobel Prize in Physiology and Medicine for their discoveries linking acetyl-CoA and fatty acid metabolism. Fritz Lipmann won the Nobel Prize in 1953 for his discovery of the cofactor coenzyme A.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"AcetylCoA2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,11]]},"language":"en","note":"Page Version ID: 1087344668","source":"Wikipedia","title":"Acetyl-CoA","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Acetyl-CoA&oldid=1087344668"},
  {"id":"AcetylCoACrossroads","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"AcetylCoACrossroads","title":"Acetyl CoA Crossroads","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/623acetylCoAfate.html"},
  {"id":"Acid2022","abstract":"An acid is a molecule or ion capable of either donating a proton (i.e. hydrogen ion, H+), known as a Brønsted–Lowry acid, or forming a covalent bond with an electron pair, known as a Lewis acid.The first category of acids are the proton donors, or Brønsted–Lowry acids. In the special case of aqueous solutions, proton donors form the hydronium ion H3O+ and are known as Arrhenius acids. Brønsted and Lowry generalized the Arrhenius theory to include non-aqueous solvents. A Brønsted or Arrhenius acid usually contains a hydrogen atom bonded to a chemical structure that is still energetically favorable after loss of H+.\nAqueous Arrhenius acids have characteristic properties that provide a practical description of an acid. Acids form aqueous solutions with a sour taste, can turn blue litmus red, and react with bases and certain metals (like calcium) to form salts. The word acid is derived from the Latin acidus/acēre, meaning 'sour'. An aqueous solution of an acid has a pH less than 7 and is colloquially also referred to as \"acid\" (as in \"dissolved in acid\"), while the strict definition refers only to the solute. A lower pH means a higher acidity, and thus a higher concentration of positive hydrogen ions in the solution. Chemicals or substances having the property of an acid are said to be acidic.\nCommon aqueous acids include hydrochloric acid (a solution of hydrogen chloride that is found in gastric acid in the stomach and activates digestive enzymes), acetic acid (vinegar is a dilute aqueous solution of this liquid), sulfuric acid (used in car batteries), and citric acid (found in citrus fruits). As these examples show, acids (in the colloquial sense) can be solutions or pure substances, and can be derived from acids (in the strict sense) that are solids, liquids, or gases. Strong acids and some concentrated weak acids are corrosive, but there are exceptions such as carboranes and boric acid.\nThe second category of acids are Lewis acids, which form a covalent bond with an electron pair. An example is boron trifluoride (BF3), whose boron atom has a vacant orbital that can form a covalent bond by sharing a lone pair of electrons on an atom in a base, for example the nitrogen atom in ammonia (NH3). Lewis considered this as a generalization of the Brønsted definition, so that an acid is a chemical species that accepts electron pairs either directly or by releasing protons (H+) into the solution, which then accept electron pairs. Hydrogen chloride, acetic acid, and most other Brønsted–Lowry acids cannot form a covalent bond with an electron pair, however, and are therefore not Lewis acids. Conversely, many Lewis acids are not Arrhenius or Brønsted–Lowry acids. In modern terminology, an acid is implicitly a Brønsted acid and not a Lewis acid, since chemists almost always refer to a Lewis acid explicitly as a Lewis acid.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Acid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,31]]},"language":"en","note":"Page Version ID: 1090817663","source":"Wikipedia","title":"Acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Acid&oldid=1090817663"},
  {"id":"AcylGroup2022","abstract":"An acyl group is a moiety derived by the removal of one or more hydroxyl groups from an oxoacid, including inorganic acids. It contains a double-bonded oxygen atom and an alkyl group (R-C=O). In organic chemistry, the acyl group (IUPAC name: alkanoyl) is usually derived from a carboxylic acid, in which case it has the formula RCO–, where R represents an alkyl group that is linked to the carbon atom of the group by a single bond. Although the term is almost always applied to organic compounds, acyl groups can in principle be derived from other types of acids such as sulfonic acids and phosphonic acids. In the most common arrangement, acyl groups are attached to a larger molecular fragment, in which case the carbon and oxygen atoms are linked by a double bond.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"AcylGroup2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,16]]},"language":"en","note":"Page Version ID: 1093480322","source":"Wikipedia","title":"Acyl group","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Acyl_group&oldid=1093480322"},
  {"id":"AdenosineDiphosphate2022","abstract":"Adenosine diphosphate (ADP), also known as adenosine pyrophosphate (APP), is an important organic compound in metabolism and is essential to the flow of energy in living cells. ADP consists of three important structural components: a sugar backbone attached to adenine and two phosphate groups bonded to the 5 carbon atom of ribose. The diphosphate group of ADP is attached to the 5’ carbon of the sugar backbone, while the adenine attaches to the 1’ carbon.ADP can be interconverted to adenosine triphosphate (ATP) and adenosine monophosphate (AMP). ATP contains one more phosphate group than does ADP. AMP contains one fewer phosphate group. Energy transfer used by all living things is a result of dephosphorylation of ATP by enzymes known as ATPases. The cleavage of a phosphate group from ATP results in the coupling of energy to metabolic reactions and a by-product of ADP. ATP is continually reformed from lower-energy species ADP and AMP. The biosynthesis of ATP is achieved throughout processes such as substrate-level phosphorylation, oxidative phosphorylation, and photophosphorylation, all of which facilitate the addition of a phosphate group to ADP.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"AdenosineDiphosphate2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,14]]},"language":"en","note":"Page Version ID: 1082584427","source":"Wikipedia","title":"Adenosine diphosphate","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Adenosine_diphosphate&oldid=1082584427"},
  {"id":"AdenosineMonophosphate2021","abstract":"Adenosine monophosphate (AMP), also known as 5'-adenylic acid, is a nucleotide. AMP consists of a phosphate group, the sugar ribose, and the nucleobase adenine; it is an ester of phosphoric acid and the nucleoside adenosine. As a substituent it takes the form of the prefix adenylyl-.AMP plays an important role in many cellular metabolic processes, being interconverted to ADP and/or ATP. AMP is also a component in the synthesis of RNA. AMP is present in all known forms of life.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"AdenosineMonophosphate2021","container-title":"Wikipedia","issued":{"date-parts":[[2021,9,13]]},"language":"en","note":"Page Version ID: 1044166247","source":"Wikipedia","title":"Adenosine monophosphate","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Adenosine_monophosphate&oldid=1044166247"},
  {"id":"AdenosineTriphosphate2022","abstract":"Adenosine triphosphate (ATP) is an organic compound and hydrotrope that provides energy to drive many processes in living cells, such as muscle contraction, nerve impulse propagation, condensate dissolution, and chemical synthesis. Found in all known forms of life, ATP is often referred to as the \"molecular unit of currency\" of intracellular energy transfer.  When consumed in metabolic processes, it converts either to adenosine diphosphate (ADP) or to adenosine monophosphate (AMP). Other processes regenerate ATP so that the human body recycles its own body weight equivalent in ATP each day.  It is also a precursor to DNA and RNA, and is used as a coenzyme.\nFrom the perspective of biochemistry, ATP is classified as a nucleoside triphosphate, which indicates that it consists of three components: a nitrogenous base (adenine), the sugar ribose, and the triphosphate.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"AdenosineTriphosphate2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,21]]},"language":"en","note":"Page Version ID: 1094188900","source":"Wikipedia","title":"Adenosine triphosphate","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Adenosine_triphosphate&oldid=1094188900"},
  {"id":"AdenosineTriphosphateSynthesis","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"AdenosineTriphosphateSynthesis","title":"Adenosine Triphosphate Synthesis - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/adenosine-triphosphate-synthesis"},
  {"id":"adminDifferenceEsterEther2015","abstract":"What is the Difference Between Ester and Ether? Unlike ether, ester has a carbonyl group; hence, easily polarizable. Ether is derived from alcohols. Ester..","accessed":{"date-parts":[[2022,6,19]]},"author":[{"literal":"admin"}],"citation-key":"adminDifferenceEsterEther2015","container-title":"Pediaa.Com","issued":{"date-parts":[[2015,12,3]]},"language":"en-US","section":"Chemistry","title":"Difference Between Ester and Ether","type":"webpage","URL":"https://pediaa.com/difference-between-ester-and-ether/"},
  {"id":"Aldehyde2022","abstract":"In organic chemistry, an aldehyde () is an organic compound containing a functional group with the structure R−CH=O. The functional group itself (without the \"R\" side chain) can be referred to as an aldehyde but can also be classified as a formyl group.  Aldehydes are common and play important roles in the technology and biological spheres.","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"Aldehyde2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,14]]},"language":"en","note":"Page Version ID: 1093060108","source":"Wikipedia","title":"Aldehyde","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Aldehyde&oldid=1093060108"},
  {"id":"Alkane2022","abstract":"In organic chemistry, an alkane, or paraffin (a historical trivial name that also has other meanings), is an acyclic saturated hydrocarbon. In other words, an alkane consists of hydrogen and carbon atoms arranged in a tree structure in which all the carbon–carbon bonds are single. Alkanes have the general chemical formula CnH2n+2. The alkanes range in complexity from the simplest case of methane (CH4), where n = 1 (sometimes called the parent molecule), to arbitrarily large and complex molecules, like pentacontane (C50H102) or 6-ethyl-2-methyl-5-(1-methylethyl) octane, an isomer of tetradecane (C14H30).\nThe International Union of Pure and Applied Chemistry (IUPAC) defines alkanes as \"acyclic branched or unbranched hydrocarbons having the general formula CnH2n+2, and therefore consisting entirely of hydrogen atoms and saturated carbon atoms\". However, some sources use the term to denote any saturated hydrocarbon, including those that are either monocyclic (i.e. the cycloalkanes) or polycyclic, despite their having a distinct general formula (i.e. cycloalkanes are CnH2n).\nIn an alkane, each carbon atom is sp3-hybridized with 4 sigma bonds (either C–C or C–H), and each hydrogen atom is joined to one of the carbon atoms (in a C–H bond). The longest series of linked carbon atoms in a molecule is known as its carbon skeleton or carbon backbone. The number of carbon atoms may be considered as the size of the alkane.\nOne group of the higher alkanes are waxes, solids at standard ambient temperature and pressure (SATP), for which the number of carbon atoms in the carbon backbone is greater than about 17.\nWith their repeated –CH2 units, the alkanes constitute a homologous series of organic compounds in which the members differ in molecular mass by multiples of 14.03 u (the total mass of each such methylene-bridge unit, which comprises a single carbon atom of mass 12.01 u and two hydrogen atoms of mass ~1.01 u each).\nMethane is produced by methanogenic bacteria and some long-chain alkanes function as pheromones in certain animal species or as protective waxes in plants and fungi. Nevertheless, most alkanes do not have much biological activity.  They can be viewed as molecular trees upon which can be hung the more active/reactive functional groups of biological molecules.\nThe alkanes have two main commercial sources: petroleum (crude oil) and natural gas.\nAn alkyl group is an alkane-based molecular fragment that bears one open valence for bonding. They are generally abbreviated with the symbol for any organyl group, R, although Alk is sometimes used to specifically symbolize an alkyl group (as opposed to an alkenyl group or aryl group).","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Alkane2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,3]]},"language":"en","note":"Page Version ID: 1091303832","source":"Wikipedia","title":"Alkane","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Alkane&oldid=1091303832"},
  {"id":"Alkyl2022","abstract":"In organic chemistry, an alkyl substituent is an alkane missing one hydrogen.\nThe term alkyl is intentionally unspecific to include many possible substitutions. \nAn acyclic alkyl has the general formula of CnH2n+1. A cycloalkyl is derived from a cycloalkane by removal of a hydrogen atom from a ring and has the general formula CnH2n-1.\nTypically an alkyl is a part of a larger molecule. In structural formulae, the symbol R is used to designate a generic (unspecified) alkyl group. The smallest alkyl group is methyl, with the formula CH−3.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Alkyl2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,13]]},"language":"en","note":"Page Version ID: 1087623015","source":"Wikipedia","title":"Alkyl","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Alkyl&oldid=1087623015"},
  {"id":"americandiabetesassociationDiagnosisClassificationDiabetes2014","accessed":{"date-parts":[[2022,6,4]]},"author":[{"literal":"American Diabetes Association"}],"citation-key":"americandiabetesassociationDiagnosisClassificationDiabetes2014","container-title":"Diabetes Care","DOI":"10.2337/dc14-S081","ISSN":"0149-5992, 1935-5548","issue":"Supplement_1","issued":{"date-parts":[[2014,1,1]]},"language":"en","page":"S81-S90","source":"DOI.org (Crossref)","title":"Diagnosis and Classification of Diabetes Mellitus","type":"article-journal","URL":"https://diabetesjournals.org/care/article/37/Supplement_1/S81/37753/Diagnosis-and-Classification-of-Diabetes-Mellitus","volume":"37"},
  {"id":"Amide2022","abstract":"In organic chemistry, an amide ( or  or  (listen), also known as an organic amide or a carboxamide, is a compound with the general formula RC(=O)NR′R″, where R, R', and R″ represent organic groups or hydrogen atoms. The amide group is called a peptide bond when it is part of the main chain of a protein, and an isopeptide bond when it occurs in a side chain, such as in the amino acids asparagine and glutamine. It can be viewed as a derivative of a carboxylic acid RC(=O)OH with the hydroxyl group –OH replaced by an amine group −NR′R″; or, equivalently, an acyl (alkanoyl) group RC(=O)− joined to an amine group.\nCommon examples of amides are acetamide H3C−CONH2, benzamide C6H5−CONH2, and dimethylformamide HCON(−CH3)2.\nAmides are qualified as primary, secondary, and tertiary according to whether the amine subgroup has the form −NH2, −NHR, or −NRR', where R and R' are groups other than hydrogen.The core −C(=O)N= of amides is called the amide group (specifically, carboxamide group).\nAmides are pervasive in nature and technology. Proteins and important plastics like Nylons, Aramid, Twaron, and Kevlar are polymers whose units are connected by amide groups (polyamides); these linkages are easily formed, confer structural rigidity, and resist hydrolysis. Amides include many other important biological compounds, as well as many drugs like paracetamol, penicillin and LSD. Low-molecular-weight amides, such as dimethylformamide, are common solvents.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Amide2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,2,27]]},"language":"en","note":"Page Version ID: 1074308192","source":"Wikipedia","title":"Amide","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Amide&oldid=1074308192"},
  {"id":"Anhydride2022","abstract":"Ein Anhydrid (von griechisch án(h)ydros  wasserlos, wasserfrei) ist eine chemische Verbindung, die aus einer Säure oder Base durch Entzug von Wasser entsteht.\nBeispielsweise ist Kohlendioxid das Anhydrid der sehr instabilen Kohlensäure.\n\nNichtmetalloxide wie Schwefeltrioxid oder Phosphor(V)-oxid sind Säureanhydride.Metalloxide wie Calciumoxid werden als Basenanhydride bezeichnet.Anhydride, die aus zwei Carbonsäure-Molekülen durch Abspaltung eines Wasser-Moleküls entstehen, werden in der Chemie Carbonsäureanhydride genannt. Beispiel: Acetanhydrid, das Anhydrid der Essigsäure.Maleinsäureanhydrid ist ein cyclisches Carbonsäureanhydrid, das durch Wasserabspaltung aus Maleinsäure (eine Dicarbonsäure) entsteht.Kristallwasserfreie Substanzen (z. B. Minerale) werden demgegenüber als Anhydrat bezeichnet.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Anhydride2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,1,24]]},"language":"de","note":"Page Version ID: 219511749","source":"Wikipedia","title":"Anhydride","type":"entry-encyclopedia","URL":"https://de.wikipedia.org/w/index.php?title=Anhydride&oldid=219511749"},
  {"id":"Aromaticity2022","abstract":"In chemistry, aromaticity is a property of cyclic (ring-shaped), typically planar (flat) molecular structures with pi bonds in resonance (those containing delocalized electrons) that gives increased stability compared with other geometric or connective arrangements with the same set of atoms. Aromatic rings are very stable and do not break apart easily. Organic compounds that are not aromatic are classified as aliphatic compounds—they might be cyclic, but only aromatic rings have enhanced stability.\nSince the most common aromatic compounds are derivatives of benzene (an aromatic hydrocarbon common in petroleum and its distillates), the word aromatic occasionally refers informally to benzene derivatives, and so it was first defined. Nevertheless, many non-benzene aromatic compounds exist. In living organisms, for example, the most common aromatic rings are the double-ringed bases in RNA and DNA. An aromatic functional group or other substituent is called an aryl group.\nThe earliest use of the term aromatic was in an article by August Wilhelm Hofmann in 1855.  Hofmann used the term for a class  of benzene compounds, many of which have odors (aromas), unlike pure saturated hydrocarbons. Aromaticity as a chemical property bears no general relationship with the olfactory properties of such compounds (how they smell), although in 1855, before the structure of benzene or organic compounds was understood, chemists like Hofmann were beginning to understand that odiferous molecules from plants, such as terpenes, had chemical properties that we recognize today are similar to unsaturated petroleum hydrocarbons like benzene.\nIn terms of the electronic nature of the molecule, aromaticity describes a conjugated system often made of alternating single and double bonds in a ring. This configuration allows for the electrons in the molecule's pi system to be delocalized around the ring, increasing the molecule's stability. The molecule cannot be represented by one structure, but rather a resonance hybrid of different structures, such as with the two resonance structures of benzene. These molecules cannot be found in either one of these representations, with the longer single bonds in one location and the shorter double bond in another (see Theory below). Rather, the molecule exhibits bond lengths in between those of single and double bonds. This commonly seen model of aromatic rings, namely the idea that benzene was formed from a six-membered carbon ring with alternating single and double bonds (cyclohexatriene), was developed by August Kekulé (see History below). The model for benzene consists of two resonance forms, which corresponds to the double and single bonds superimposing to produce six one-and-a-half bonds.  Benzene is a more stable molecule than would be expected without accounting for charge delocalization.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Aromaticity2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,11]]},"language":"en","note":"Page Version ID: 1087324899","source":"Wikipedia","title":"Aromaticity","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Aromaticity&oldid=1087324899"},
  {"id":"Artery2022","abstract":"An artery (plural  arteries) (from Greek  ἀρτηρία (artēríā) 'windpipe, artery') is a blood vessel in humans and most other animals that takes blood away from the heart to one or more parts of the body (tissues, lungs, brain etc.). Most arteries carry oxygenated blood; the two exceptions are the pulmonary and the umbilical arteries, which carry deoxygenated blood to the organs that oxygenate it (lungs and placenta, respectively). The effective arterial blood volume is that extracellular fluid which fills the arterial system.\nThe arteries are part of the circulatory system, that is responsible for the delivery of oxygen and nutrients to all cells, as well as the removal of carbon dioxide and waste products, the maintenance of optimum blood pH, and the circulation of proteins and cells of the immune system.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"Artery2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,2,15]]},"language":"en","note":"Page Version ID: 1071911983","source":"Wikipedia","title":"Artery","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Artery&oldid=1071911983"},
  {"id":"Aryl2022","abstract":"In organic chemistry, an aryl is any functional group or substituent derived from an aromatic ring, usually an aromatic hydrocarbon, such as phenyl and naphthyl. \"Aryl\" is used for the sake of abbreviation or generalization, and \"Ar\" is used as a placeholder for the aryl group in chemical structure diagrams, analogous to “R” used for any organic substituent. “Ar” is not to be confused with the elemental symbol for argon.\nA simple aryl group is phenyl (C6H5), a group derived from benzene. Examples of other aryl groups consist of:\n\nThe tolyl group (CH3C6H4) which is derived from toluene (methylbenzene)\nThe xylyl group ([CH3]2C6H3), which is derived from xylene (dimethylbenzene)\nThe naphthyl group (C10H8), which is derived from naphthaleneArylation is the process in which an aryl group is attached to a substituent.  It is typically achieved by cross-coupling reactions.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Aryl2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,23]]},"language":"en","note":"Page Version ID: 1084330870","source":"Wikipedia","title":"Aryl","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Aryl&oldid=1084330870"},
  {"id":"ATPSynthase2022","abstract":"ATP synthase is a protein that catalyzes the formation of the energy storage molecule adenosine triphosphate (ATP) using adenosine diphosphate (ADP) and inorganic phosphate (Pi). It is classified under ligases as it changes ADP by the formation of P-O bond (phosphodiester bond). ATP synthase is a molecular machine. The overall reaction catalyzed by ATP synthase is:\n\nADP + Pi + 2H+out ⇌ ATP + H2O + 2H+inThe formation of ATP from ADP and Pi is energetically unfavorable and would normally proceed in the reverse direction. In order to drive this reaction forward, ATP synthase couples ATP synthesis during cellular respiration to an electrochemical gradient created by the difference in proton (H+) concentration across the inner mitochondrial membrane in eukaryotes or the plasma membrane in bacteria. During photosynthesis in plants, ATP is synthesized by ATP synthase using a proton gradient created in the thylakoid lumen through the thylakoid membrane and into the chloroplast stroma.\nEukaryotic ATP synthases are F-ATPases, running \"in reverse\" for an ATPase. This article deals mainly with this type. An F-ATPase consists of two main subunits, FO and F1, which has a rotational motor mechanism allowing for ATP production.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"ATPSynthase2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,3,26]]},"language":"en","note":"Page Version ID: 1079393166","source":"Wikipedia","title":"ATP synthase","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=ATP_synthase&oldid=1079393166"},
  {"id":"bellazziBayesianAnalysisBlood2000","abstract":"This paper describes the application of a novel Bayesian estimation technique to extract the structural components, i.e., trend and daily patterns, from blood glucose level time series coming from home monitoring of insulin dependent diabetes mellitus patients. The problem is formulated through a set of stochastic equations, and is solved in a Bayesian framework by using a Markov chain Monte Carlo technique. The potential of the method is illustrated by analyzing data coming from the home monitoring of a 14-year old male patient.","author":[{"family":"Bellazzi","given":"Riccardo"},{"family":"Magni","given":"Paolo"},{"family":"Nicolao","given":"Giuseppe"}],"citation-key":"bellazziBayesianAnalysisBlood2000","container-title":"IEEE transactions on bio-medical engineering","container-title-short":"IEEE transactions on bio-medical engineering","DOI":"10.1109/10.846693","issued":{"date-parts":[[2000,8,1]]},"page":"971-5","source":"ResearchGate","title":"Bayesian analysis of blood glucose time series from diabetes home monitoring","type":"article-journal","volume":"47"},
  {"id":"bellazziIntelligentAnalysisClinical","accessed":{"date-parts":[[2022,4,27]]},"author":[{"family":"Bellazzi","given":"R."},{"family":"Larizza","given":"C."},{"family":"Magni","given":"P."},{"family":"Montani","given":"S."},{"family":"Stefanelli","given":"M."}],"citation-key":"bellazziIntelligentAnalysisClinical","DOI":"10.1016/S0933-3657(00)00052-X","language":"en","title":"Intelligent analysis of clinical time series: an application in the diabetes mellitus domain","title-short":"PII","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S093336570000052X?token=2F010F854209C6206D867A30AEB212BCDD1204F076C59CA1EF00E5144A93610552C7B0BE4D36417C1C2E3D8A1F905532&originRegion=eu-west-1&originCreation=20220427234616"},
  {"id":"benderCitricAcidCycle2016","abstract":"OBJECTIVESAfter studying this chapter, you should be able to:Describe the reactions of the citric acid cycle and the reactions that lead to the production of reducing equivalents that are oxidized in the mitochondrial electron transport chain to yield ATP. Explain the importance of vitamins in the citric acid cycle.Explain how the citric acid cycle provides both a route for catabolism of amino acids and also a route for their synthesis.Describe the main anaplerotic pathways that permit replenishment of citric acid cycle intermediates, and how the withdrawal of oxaloacetate for gluconeogenesis is controlled.Describe the role of the citric acid cycle in fatty acid synthesis.Explain how the activity of the citric acid cycle is controlled by the availability of oxidized cofactors.Explain how hyperammonemia can lead to loss of consciousness.","accessed":{"date-parts":[[2022,6,5]]},"author":[{"family":"Bender","given":"David A."},{"family":"Mayes","given":"Peter A."}],"citation-key":"benderCitricAcidCycle2016","container-title":"Harper's Illustrated Biochemistry","edition":"30","editor":[{"family":"Rodwell","given":"Victor W."},{"family":"Bender","given":"David A."},{"family":"Botham","given":"Kathleen M."},{"family":"Kennelly","given":"Peter J."},{"family":"Weil","given":"P. Anthony"}],"event-place":"New York, NY","issued":{"date-parts":[[2016]]},"publisher":"McGraw-Hill Education","publisher-place":"New York, NY","source":"Access Medicine","title":"The Citric Acid Cycle: The Central Pathway of Carbohydrate, Lipid & Amino Acid Metabolism","title-short":"The Citric Acid Cycle","type":"chapter","URL":"https://accessmedicine.mhmedical.com/Content.aspx?bookId=1366&sectionId=73243571#1106056878"},
  {"id":"bewickchemistryAlcoholDehydrationMechanism2020","abstract":"Elimination / dehydration reaction mechanism for secondary and primary alcohols with a sulfuric acid catalyst","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"bewickchemistryAlcoholDehydrationMechanism2020","dimensions":"9:49","director":[{"literal":"Bewickchemistry"}],"issued":{"date-parts":[[2020,3,26]]},"source":"YouTube","title":"Alcohol Dehydration Mechanism","type":"motion_picture","URL":"https://www.youtube.com/watch?v=eChpMza8it4"},
  {"id":"BondCleavage2022","abstract":"Bond cleavage, or bond fission, is the splitting of chemical bonds. This can be generally referred to as Dissociation (chemistry) when a molecule is cleaved into two or more fragments.In general, there are two classifications for bond cleavage: homolytic and heterolytic, depending on the nature of the process. The triplet and singlet excitation energies of a sigma bond can be used to determine if a bond will follow the homolytic or heterolytic pathway. A metal−metal sigma bond is an exception because the bond's excitation energy is extremely high, thus cannot be used for observation purposes.In some cases, bond cleavage requires catalysts. Due to the high bond-dissociation energy of C−H bond, around 100 kcal/mol (420 kJ/mol), a large amount of energy is required to cleave the hydrogen atom from the carbon and bond a different atom to the carbon.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"BondCleavage2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,4]]},"language":"en","note":"Page Version ID: 1086228547","source":"Wikipedia","title":"Bond cleavage","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Bond_cleavage&oldid=1086228547"},
  {"id":"CarbohydratesGlucose","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"CarbohydratesGlucose","title":"Carbohydrates - Glucose","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/543glucose.html"},
  {"id":"CarbohydratesGlycogen","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"CarbohydratesGlycogen","title":"Carbohydrates - Glycogen","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/547glycogen.html"},
  {"id":"CarbonylGroup2022","abstract":"In organic chemistry, a carbonyl group is a functional group composed of a carbon atom double-bonded to an oxygen atom: C=O. It is common to several classes of organic compounds, as part of many larger functional groups. A compound containing a carbonyl group is often referred to as a carbonyl compound.The term carbonyl can also refer to carbon monoxide as a ligand in an inorganic or organometallic complex (a metal carbonyl, e.g. nickel carbonyl).\nThe remainder of this article concerns itself with the organic chemistry definition of carbonyl, where carbon and oxygen share a double bond.","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"CarbonylGroup2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,22]]},"language":"en","note":"Page Version ID: 1083992451","source":"Wikipedia","title":"Carbonyl group","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Carbonyl_group&oldid=1083992451"},
  {"id":"CarboxylicAcid2022","abstract":"A carboxylic acid is an organic acid that contains a carboxyl group (C(=O)OH) attached to an R-group. The general formula of a carboxylic acid is R−COOH or R−CO2H, with R referring to the alkyl, alkenyl, aryl, or other group.  Carboxylic acids occur widely. Important examples include the amino acids and fatty acids. Deprotonation of a carboxylic acid gives a carboxylate anion.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"CarboxylicAcid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,15]]},"language":"en","note":"Page Version ID: 1093223351","source":"Wikipedia","title":"Carboxylic acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Carboxylic_acid&oldid=1093223351"},
  {"id":"CarboxylicAcidsEsters2021","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"CarboxylicAcidsEsters2021","container-title":"Chemistry LibreTexts","issued":{"date-parts":[[2021,9,24]]},"language":"en","title":"9.8: Carboxylic Acids and Esters","title-short":"9.8","type":"webpage","URL":"https://chem.libretexts.org/Courses/Sacramento_City_College/SCC%3A_CHEM_330_-_Adventures_in_Chemistry_(Alviar-Agnew)/09%3A_Organic_Chemistry/9.08%3A_Carboxylic_Acids_and_Esters"},
  {"id":"CH105ChapterAlkenes","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"CH105ChapterAlkenes","language":"en-US","title":"CH105: Chapter 8 – Alkenes, Alkynes and Aromatic Compounds – Chemistry","title-short":"CH105","type":"post-weblog","URL":"https://wou.edu/chemistry/courses/online-chemistry-textbooks/ch105-consumer-chemistry/ch105-chapter-8/"},
  {"id":"ChemicalPolarity2022","abstract":"In chemistry, polarity is a separation of electric charge leading to a molecule or its chemical groups having an electric dipole moment, with a negatively charged end and a positively charged end.\nPolar molecules must contain one or more polar bonds due to a difference in electronegativity between the bonded atoms. Molecules containing polar bonds have no molecular polarity if the bond dipoles cancel each other out by symmetry.\nPolar molecules interact through dipole–dipole intermolecular forces and hydrogen bonds. Polarity underlies a number of physical properties including surface tension, solubility, and melting and boiling points.","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"ChemicalPolarity2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,17]]},"language":"en","note":"Page Version ID: 1093645060","source":"Wikipedia","title":"Chemical polarity","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Chemical_polarity&oldid=1093645060"},
  {"id":"ChemicalSynthesis2022","abstract":"As a topic of chemistry, chemical synthesis (or combination) is the artificial execution of chemical reactions to obtain one or several products. This occurs by physical and chemical manipulations usually involving one or more reactions. In modern laboratory uses, the process is reproducible and reliable.\nA chemical synthesis involves one or more compounds (known as reagents or reactants) that will experience a transformation when subjected to certain conditions. Various reaction types can be applied to formulate a desired product. This requires mixing the compounds in a reaction vessel, such as a chemical reactor or a simple round-bottom flask. Many reactions require some form of processing (\"work-up\") or purification procedure to isolate the final product.The amount produced by chemical synthesis is known as the reaction yield. Typically, yields are expressed as a mass in grams (in a laboratory setting) or as a percentage of the total theoretical quantity that could be produced based on the limiting reagent. A side reaction is an unwanted chemical reaction occurring which reduces the desired yield. The word synthesis was used first in a chemical context by the chemist Hermann Kolbe.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"ChemicalSynthesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,8]]},"language":"en","note":"Page Version ID: 1086756094","source":"Wikipedia","title":"Chemical synthesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Chemical_synthesis&oldid=1086756094"},
  {"id":"CitricAcidCycle2022","abstract":"The citric acid cycle (CAC)—also known as the Krebs cycle or the TCA cycle (tricarboxylic acid cycle)—is a series of chemical reactions to release stored energy through the oxidation of acetyl-CoA derived from carbohydrates, fats, and proteins. The Krebs cycle is used by organisms that respire (as opposed to organisms that ferment) to generate energy, either by anaerobic respiration or aerobic respiration. In addition, the cycle provides precursors of certain amino acids, as well as the reducing agent NADH, that are used in numerous other reactions. Its central importance to many biochemical pathways suggests that it was one of the earliest components of metabolism and may have originated abiogenically. Even though it is branded as a 'cycle', it is not necessary for metabolites to follow only one specific route; at least three alternative segments of the citric acid cycle have been recognized.The name of this metabolic pathway is derived from the citric acid (a tricarboxylic acid, often called citrate, as the ionized form predominates at biological pH) that is consumed and then regenerated by this sequence of reactions to complete the cycle. The cycle consumes acetate (in the form of acetyl-CoA) and water, reduces NAD+ to NADH, releasing carbon dioxide. The NADH generated by the citric acid cycle is fed into the oxidative phosphorylation (electron transport) pathway. The net result of these two closely linked pathways is the oxidation of nutrients to produce usable chemical energy in the form of ATP.\nIn eukaryotic cells, the citric acid cycle occurs in the matrix of the mitochondrion. In prokaryotic cells, such as bacteria, which lack mitochondria, the citric acid cycle reaction sequence is performed in the cytosol with the proton gradient for ATP production being across the cell's surface (plasma membrane) rather than the inner membrane of the mitochondrion. The overall yield of energy-containing compounds from the citric acid cycle is three NADH, one FADH2, and one GTP.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"CitricAcidCycle2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,3]]},"language":"en","note":"Page Version ID: 1091355465","source":"Wikipedia","title":"Citric acid cycle","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Citric_acid_cycle&oldid=1091355465"},
  {"id":"clarkBiology2020","abstract":"Biology 2e (2nd edition) is designed to cover the scope and sequence requirements of a typical two-semester biology course for science majors. The text provides comprehensive coverage of foundational research and core biology concepts through an evolutionary lens. Biology includes rich features that engage students in scientific inquiry, highlight careers in the biological sciences, and offer everyday applications. The book also includes various types of practice and homework questions that help students understand -- and apply -- key concepts. The 2nd edition has been revised to incorporate clearer, more current, and more dynamic explanations, while maintaining the same organization as the first edition. Art and illustrations have been substantially improved, and the textbook features additional assessments and related resources.","author":[{"family":"Clark","given":"Mary Ann"},{"family":"Choi","given":"Jung Ho"},{"family":"Douglas","given":"Matthew M"},{"literal":"OpenStax (Nonprofit organization)"}],"citation-key":"clarkBiology2020","ISBN":"978-1-947172-51-7 978-1-947172-95-1 978-1-5066-9985-1","issued":{"date-parts":[[2020]]},"language":"English","note":"OCLC: 1233239446","source":"Open WorldCat","title":"Biology","type":"book"},
  {"id":"ConjugateAcidbaseTheory2022","abstract":"A conjugate acid, within the Brønsted–Lowry acid–base theory, is a  chemical compound formed when an acid donates a proton (H+) to a base—in other words, it is a base with a hydrogen ion added to it, as in the reverse reaction it loses a hydrogen ion. On the other hand, a conjugate base is what is left over after an acid has donated a proton during a chemical reaction. Hence, a conjugate base is a species formed by the removal of a proton from an acid, as in the reverse reaction it is able to gain a hydrogen ion. Because some acids are capable of releasing multiple protons, the conjugate base of an acid may itself be acidic.\nIn summary, this can be represented as the following chemical reaction:\n\nAcid + Base ⇌ Conjugate Base + Conjugate Acid\n \nJohannes Nicolaus Brønsted and Martin Lowry introduced the Brønsted–Lowry theory,\nwhich proposed that any compound that can transfer a proton to any other compound is an acid, and the compound that accepts the proton is a base. A proton is a nuclear particle with a unit positive electrical charge; it is represented by the symbol H+ because it constitutes the nucleus of a hydrogen atom, that is, a hydrogen cation.\nA cation can be a conjugate acid, and an anion can be a conjugate base, depending on which substance is involved and which acid–base theory is the viewpoint. The simplest anion which can be a conjugate base is the solvated electron whose conjugate acid is the atomic hydrogen.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"ConjugateAcidbaseTheory2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,3]]},"language":"en","note":"Page Version ID: 1085964906","source":"Wikipedia","title":"Conjugate (acid-base theory)","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Conjugate_(acid-base_theory)&oldid=1085964906"},
  {"id":"ContractileProteinsLatest","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ContractileProteinsLatest","title":"Contractile proteins - Latest research and news | Nature","type":"webpage","URL":"https://www.nature.com/subjects/contractile-proteins"},
  {"id":"CovalentBond2022","abstract":"A covalent bond is a chemical bond that involves the sharing of electron pairs between atoms. These electron pairs are known as shared pairs or bonding pairs, and the stable balance of attractive and repulsive forces between atoms, when they share electrons, is known as covalent bonding. For many molecules, the sharing of electrons allows each atom to attain the equivalent of a full valence shell, corresponding to a stable electronic configuration. In organic chemistry, covalent bonding is much more common than ionic bonding.\nCovalent bonding also includes many kinds of interactions, including σ-bonding, π-bonding, metal-to-metal bonding, agostic interactions, bent bonds, three-center two-electron bonds and three-center four-electron bonds. The term covalent bond dates from 1939. The prefix co- means jointly, associated in action, partnered to a lesser degree,  etc.; thus a \"co-valent bond\", in essence, means that the atoms share \"valence\", such as is discussed in valence bond theory.\nIn the molecule H2, the hydrogen atoms share the two electrons via covalent bonding. Covalency is greatest between atoms of similar electronegativities. Thus, covalent bonding does not necessarily require that the two atoms be of the same elements, only that they be of comparable electronegativity. Covalent bonding that entails the sharing of electrons over more than two atoms is said to be delocalized.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"CovalentBond2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,8]]},"language":"en","note":"Page Version ID: 1092196102","source":"Wikipedia","title":"Covalent bond","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Covalent_bond&oldid=1092196102"},
  {"id":"dantoniPredictionGlucoseConcentration2022","abstract":"Background: Type 1 Diabetes Mellitus (T1D) is an autoimmune disease that can cause serious complications that can be avoided by preventing the glycemic levels from exceeding the physiological range. Straightforwardly, many data-driven models were developed to forecast future glycemic levels and to allow patients to avoid adverse events. Most models are tuned on data of adult patients, whereas the prediction of glycemic levels of pediatric patients has been rarely investigated, as they represent the most challenging T1D population. Methods: A Convolutional Neural Network (CNN) and a Long Short-Term Memory (LSTM) Recurrent Neural Network were optimized on glucose, insulin, and meal data of 10 virtual pediatric patients. The trained models were then implemented on two edge-computing boards to evaluate the feasibility of an edge system for glucose forecasting in terms of prediction accuracy and inference time. Results: The LSTM model achieved the best numeric and clinical accuracy when tested in the .tflite format, whereas the CNN achieved the best clinical accuracy in uint8. The inference time for each prediction was far under the limit represented by the sampling period. Conclusion: Both models effectively predict glucose in pediatric patients in terms of numerical and clinical accuracy. The edge implementation did not show a significant performance decrease, and the inference time was largely adequate for a real-time application.","accessed":{"date-parts":[[2022,4,27]]},"author":[{"family":"D’Antoni","given":"Federico"},{"family":"Petrosino","given":"Lorenzo"},{"family":"Sgarro","given":"Fabiola"},{"family":"Pagano","given":"Antonio"},{"family":"Vollero","given":"Luca"},{"family":"Piemonte","given":"Vincenzo"},{"family":"Merone","given":"Mario"}],"citation-key":"dantoniPredictionGlucoseConcentration2022","container-title":"Bioengineering","DOI":"10.3390/bioengineering9050183","ISSN":"2306-5354","issue":"5","issued":{"date-parts":[[2022,5]]},"language":"en","number":"5","page":"183","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"Prediction of Glucose Concentration in Children with Type 1 Diabetes Using Neural Networks: An Edge Computing Application","title-short":"Prediction of Glucose Concentration in Children with Type 1 Diabetes Using Neural Networks","type":"article-journal","URL":"https://www.mdpi.com/2306-5354/9/5/183","volume":"9"},
  {"id":"DatadrivenModelingPrediction","accessed":{"date-parts":[[2022,4,28]]},"citation-key":"DatadrivenModelingPrediction","DOI":"10.1016/j.artmed.2019.07.007","language":"en","title":"Data-driven modeling and prediction of blood glucose dynamics_ Machine learning applications in type 1 diabetes | Elsevier Enhanced Reader","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S0933365717306218?token=20D73867F133A3E0343AEF5FCFAD5EBBBDF7FD94E6EF156E29BC836D894F37633B1F34F1B933816860A41CA480C7E8E6&originRegion=eu-west-1&originCreation=20220428001325"},
  {"id":"DefinitionChronicDisease2011","abstract":"NCI's Dictionary of Cancer Terms provides easy-to-understand definitions for words and phrases related to cancer and medicine.","accessed":{"date-parts":[[2022,6,4]]},"archive_location":"nciglobal,ncienterprise","citation-key":"DefinitionChronicDisease2011","genre":"nciAppModulePage","issued":{"literal":"02/02/2011 - 07:00"},"language":"en","title":"Definition of chronic disease - NCI Dictionary of Cancer Terms - NCI","type":"webpage","URL":"https://www.cancer.gov/publications/dictionaries/cancer-terms/def/chronic-disease"},
  {"id":"DehydrationReaction2022","abstract":"In chemistry, a dehydration reaction is a chemical reaction that involves the loss of water from the reacting molecule or ion. Dehydration reactions are common processes, the reverse of a hydration reaction.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"DehydrationReaction2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,17]]},"language":"en","note":"Page Version ID: 1083210708","source":"Wikipedia","title":"Dehydration reaction","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Dehydration_reaction&oldid=1083210708"},
  {"id":"deutschComputerSystemInterpreting","accessed":{"date-parts":[[2022,4,28]]},"author":[{"family":"Deutsch","given":"T."},{"family":"Gergely","given":"T."},{"family":"Trunov","given":"V."}],"citation-key":"deutschComputerSystemInterpreting","DOI":"10.1016/j.cmpb.2004.02.008","language":"en","title":"A computer system for interpreting blood glucose data","title-short":"doi","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S0169260704000665?token=EDA90F97B6086B589E888AC4A1AD8E91B110585A4DF394BB52124B40EC1F992B80766181EBD90042D57BF1B31A6866F4&originRegion=eu-west-1&originCreation=20220428000242"},
  {"id":"DiagnosticUltrasoundClinicalKey","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"DiagnosticUltrasoundClinicalKey","title":"Diagnostic Ultrasound - ClinicalKey","type":"webpage","URL":"https://www.clinicalkey.com/#!/browse/book/3-s2.0-C20141042251"},
  {"id":"Doi101016","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Doi101016","DOI":"10.1016/j.biocel.2003.08.010","language":"en","title":"doi:10.1016/j.biocel.2003.08.010 | Elsevier Enhanced Reader","title-short":"doi","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S1357272503002917?token=875FC09A355F4783DE7F91EE681CBDB01BEFF89C6F0FC8DCA49859BC725BA617AD6F1E49D354434BEC6FFBBF2993AA5F&originRegion=eu-west-1&originCreation=20220605124441"},
  {"id":"EpimerOverviewScienceDirect","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"EpimerOverviewScienceDirect","title":"Epimer - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/epimer"},
  {"id":"EpimerOverviewScienceDirecta","citation-key":"EpimerOverviewScienceDirecta","title":"Epimer - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/epimer"},
  {"id":"Ester2022","abstract":"An ester is a chemical compound derived from an acid (organic or inorganic) in which at least one –OH hydroxyl group is replaced by an –O– alkyl (alkoxy) group, as in the substitution reaction of a carboxylic acid and an alcohol. Glycerides are fatty acid esters of glycerol; they are important in biology, being one of the main classes of lipids and comprising the bulk of animal fats and vegetable oils.\nEsters typically have a pleasant smell; those of low molecular weight are commonly used as fragrances and are found in essential oils and pheromones. They perform as high-grade solvents for a broad array of plastics, plasticizers, resins, and lacquers, and are one of the largest classes of synthetic lubricants on the commercial market. Polyesters are important plastics, with monomers linked by ester moieties. Phosphoesters form the backbone of DNA molecules. Nitrate esters, such as nitroglycerin, are known for their explosive properties.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Ester2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,2]]},"language":"en","note":"Page Version ID: 1091143519","source":"Wikipedia","title":"Ester","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ester&oldid=1091143519"},
  {"id":"EsterOverviewScienceDirect","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"EsterOverviewScienceDirect","title":"Ester - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/chemistry/ester"},
  {"id":"Ether2022","abstract":"Ethers are a class of organic compounds that contain an ether group—an oxygen atom connected to two alkyl or aryl groups.  They have the general formula R–O–R′, where R and R′ represent the alkyl or aryl groups. Ethers can again be classified into two varieties: if the alkyl or aryl groups are the same on both sides of the oxygen atom, then it is a simple or symmetrical ether, whereas if they are different, the ethers are called mixed or unsymmetrical ethers. A typical example of the first group is the solvent and anaesthetic diethyl ether, commonly referred to simply as \"ether\" (CH3–CH2–O–CH2–CH3). Ethers are common in organic chemistry and even more prevalent in biochemistry, as they are common linkages in carbohydrates and lignin.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Ether2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,22]]},"language":"en","note":"Page Version ID: 1084147465","source":"Wikipedia","title":"Ether","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ether&oldid=1084147465"},
  {"id":"FattyAcids","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"FattyAcids","title":"Fatty Acids","type":"webpage","URL":"http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/fataci.html"},
  {"id":"fowlerConceptsBiology","author":[{"family":"Fowler","given":"Samantha"},{"family":"Roush","given":"Rebecca"},{"family":"Wise","given":"James"}],"citation-key":"fowlerConceptsBiology","ISSN":"1-938168-11-9","language":"en","page":"621","source":"Zotero","title":"Concepts of Biology","type":"article-journal"},
  {"id":"Fructose2022","abstract":"Fructose, or fruit sugar, is a ketonic simple sugar found in many plants, where it is often bonded to glucose to form the disaccharide sucrose. It is one of the three dietary monosaccharides, along with glucose and galactose, that are absorbed directly into blood during digestion. Fructose was discovered by French chemist Augustin-Pierre Dubrunfaut in 1847. The name \"fructose\" was coined in 1857 by the English chemist William Allen Miller. Pure, dry fructose is a sweet, white, odorless, crystalline solid, and is the most water-soluble of all the sugars. Fructose is found in honey, tree and vine fruits, flowers, berries, and most root vegetables.\nCommercially, fructose is derived from sugar cane, sugar beets, and maize. High-fructose corn syrup is a mixture of glucose and fructose as monosaccharides. Sucrose is a compound with one molecule of glucose covalently linked to one molecule of fructose. All forms of fructose, including fruits and juices, are commonly added to foods and drinks for palatability and taste enhancement, and for browning of some foods, such as baked goods. About 240,000 tonnes of crystalline fructose are produced annually.Excessive consumption of fructose (especially from sugar-sweetened beverages) may contribute to insulin resistance, obesity, elevated LDL cholesterol and triglycerides, leading to metabolic syndrome. The European Food Safety Authority stated that fructose may be preferable over sucrose and glucose in sugar-sweetened foods and beverages because of its lower effect on postprandial blood sugar levels, while also noting the potential downside that \"high intakes of fructose may lead to metabolic complications such as dyslipidaemia, insulin resistance, and increased visceral adiposity\". The UK's Scientific Advisory Committee on Nutrition in 2015 disputed the claims of fructose causing metabolic disorders, stating that \"there is insufficient evidence to demonstrate that fructose intake, at levels consumed in the normal UK diet, leads to adverse health outcomes independent of any effects related to its presence as a component of total and free sugars.\"","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Fructose2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,15]]},"language":"en","note":"Page Version ID: 1093280958","source":"Wikipedia","title":"Fructose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Fructose&oldid=1093280958"},
  {"id":"FunctionalGroup2022","abstract":"In organic chemistry, a functional group is a substituent or moiety in a molecule that causes the molecule's characteristic chemical reactions. The same functional group will undergo the same or similar chemical reactions regardless of the rest of the molecule's composition. This enables systematic prediction of chemical reactions and behavior of chemical compounds and the design of chemical synthesis. The reactivity of a functional group can be modified by other functional groups nearby. Functional group interconversion can be used in retrosynthetic analysis to plan organic synthesis.\nA functional group is a group of atoms in a molecule with distinctive chemical properties, regardless of the other atoms in the molecule. The atoms in a functional group are linked to each other and to the rest of the molecule by covalent bonds. For repeating units of polymers, functional groups attach to their nonpolar core of carbon atoms and thus add chemical character to carbon chains. Functional groups can also be charged, e.g. in carboxylate salts (–COO−), which turns the molecule into a polyatomic ion or a complex ion. Functional groups binding to a central atom in a coordination complex are called ligands. Complexation and solvation are also caused by specific interactions of functional groups. In the common rule of thumb \"like dissolves like\", it is the shared or mutually well-interacting functional groups which give rise to solubility. For example, sugar dissolves in water because both share the hydroxyl functional group (–OH) and hydroxyls interact strongly with each other. Plus, when functional groups are more electronegative than atoms they attach to, the functional groups will become polar, and the otherwise nonpolar molecules containing these functional groups become polar and so become soluble in some aqueous environment.\nCombining the names of functional groups with the names of the parent alkanes generates what is termed a systematic nomenclature for naming organic compounds. In traditional nomenclature, the first carbon atom after the carbon that attaches to the functional group is called the alpha carbon; the second, beta carbon, the third, gamma carbon, etc. If there is another functional group at a carbon, it may be named with the Greek letter, e.g., the gamma-amine in gamma-aminobutyric acid is on the third carbon of the carbon chain attached to the carboxylic acid group. IUPAC conventions call for numeric labeling of the position, e.g. 4-aminobutanoic acid. In traditional names various qualifiers are used to label isomers, for example, isopropanol (IUPAC name: propan-2-ol) is an isomer of n-propanol (propan-1-ol). The term moiety has some overlap with the term \"functional group\". However, a moiety is an entire \"half\" of a molecule, which can be only a single functional group, but also a larger unit consisting of multiple functional groups. For example, an \"aryl moiety\" may be any group containing an aromatic ring, regardless of how many functional groups the said aryl has.","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"FunctionalGroup2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,6]]},"language":"en","note":"Page Version ID: 1086476038","source":"Wikipedia","title":"Functional group","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Functional_group&oldid=1086476038"},
  {"id":"FunctionsProteins","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"FunctionsProteins","title":"Functions of Proteins","type":"webpage","URL":"https://sphweb.bumc.bu.edu/otlt/mph-modules/ph/ph709_basiccellbiology/ph709_basiccellbiology7.html"},
  {"id":"Galactose2022","abstract":"Galactose (, galacto- + -ose, \"milk sugar\") sometimes abbreviated Gal, is a monosaccharide sugar that is about as sweet as glucose, and about 65% as sweet as sucrose. It is an aldohexose and a C-4 epimer of glucose. A galactose molecule linked with a glucose molecule forms a lactose molecule.\nGalactan is a polymeric form of galactose found in hemicellulose, and forming the core of the galactans, a class of natural polymeric carbohydrates.D-Galactose is also known as brain sugar since it is a component of glycoproteins (oligosaccharide-protein compounds) found in nerve tissue.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Galactose2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,26]]},"language":"en","note":"Page Version ID: 1089922023","source":"Wikipedia","title":"Galactose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Galactose&oldid=1089922023"},
  {"id":"gillespieType1Diabetes2016","accessed":{"date-parts":[[2022,4,28]]},"citation-key":"gillespieType1Diabetes2016","collection-title":"Methods in Molecular Biology","DOI":"10.1007/978-1-4939-3643-4","editor":[{"family":"Gillespie","given":"Kathleen M."}],"event-place":"New York, NY","ISBN":"978-1-4939-3641-0 978-1-4939-3643-4","issued":{"date-parts":[[2016]]},"language":"en","publisher":"Springer New York","publisher-place":"New York, NY","source":"DOI.org (Crossref)","title":"Type-1 Diabetes","type":"book","URL":"http://link.springer.com/10.1007/978-1-4939-3643-4","volume":"1433"},
  {"id":"GlucogenicAminoAcid2022","abstract":"A glucogenic amino acid (or glucoplastic amino acid) is an amino acid that can be converted into glucose through gluconeogenesis. This is in contrast to the ketogenic amino acids, which are converted into ketone bodies.\nThe production of glucose from glucogenic amino acids involves these amino acids being converted to alpha keto acids and then to glucose, with both processes occurring in the liver. This mechanism predominates during catabolysis, rising as fasting and starvation increase in severity.\nIn humans, the glucogenic amino acids are:\n\nAlanine\nArginine\nAsparagine\nAspartic acid\nCysteine\nGlutamic acid\nGlutamine\nGlycine\nHistidine\nMethionine\nProline\nSerine\nValineAmino acids that are both glucogenic and ketogenic (mnemonic \"PITTT\"):\n\nPhenylalanine\nIsoleucine\nThreonine\nTryptophan\nTyrosineOnly leucine and lysine are not glucogenic (they are only ketogenic).","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"GlucogenicAminoAcid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,2,18]]},"language":"en","note":"Page Version ID: 1072536547","source":"Wikipedia","title":"Glucogenic amino acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Glucogenic_amino_acid&oldid=1072536547"},
  {"id":"GlucogenicKetogenicAmino","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"GlucogenicKetogenicAmino","container-title":"Khan Academy","language":"en","title":"Glucogenic and ketogenic amino acids (practice)","type":"webpage","URL":"https://www.khanacademy.org/test-prep/mcat/biological-sciences-practice/biological-sciences-practice-tut/e/krebs-cycle-and-oxidative-phosphorylation---passage-2"},
  {"id":"Glucokinase2022","abstract":"Glucokinase (EC 2.7.1.2) is an enzyme that facilitates phosphorylation of glucose to glucose-6-phosphate. Glucokinase occurs in cells in the liver and pancreas of humans and most other vertebrates. In each of these organs it plays an important role in the regulation of carbohydrate metabolism by acting as a glucose sensor, triggering shifts in metabolism or cell function in response to rising or falling levels of glucose, such as occur after a meal or when fasting. Mutations of the gene for this enzyme can cause unusual forms of diabetes or hypoglycemia.\nGlucokinase (GK) is a hexokinase isozyme, related homologously to at least three other hexokinases. All of the hexokinases can mediate phosphorylation of glucose to glucose-6-phosphate (G6P), which is the first step of both glycogen synthesis and glycolysis. However, glucokinase is coded by a separate gene and its distinctive kinetic properties allow it to serve a different set of functions. Glucokinase has a lower affinity for glucose than the other hexokinases do, and its activity is localized to a few cell types, leaving the other three hexokinases as more important preparers of glucose for glycolysis and glycogen synthesis for most tissues and organs. Because of this reduced affinity, the activity of glucokinase, under usual physiological conditions, varies substantially according to the concentration of glucose.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Glucokinase2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,3]]},"language":"en","note":"Page Version ID: 1091370554","source":"Wikipedia","title":"Glucokinase","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Glucokinase&oldid=1091370554"},
  {"id":"Glycogenesis2022","abstract":"Glycogenesis is the process of glycogen synthesis, in which glucose molecules are added to chains of glycogen for storage. This process is activated during rest periods following the Cori cycle, in the liver, and also activated by insulin in response to high glucose levels.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Glycogenesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,3,3]]},"language":"en","note":"Page Version ID: 1075000146","source":"Wikipedia","title":"Glycogenesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Glycogenesis&oldid=1075000146"},
  {"id":"Glycogenesisa","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Glycogenesisa","title":"Glycogenesis","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/604glycogenesis.html"},
  {"id":"GlycogenesisGlycogenolysisGluconeogenesis","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"GlycogenesisGlycogenolysisGluconeogenesis","title":"Glycogenesis, Glycogenolysis, and Gluconeogenesis","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/604glycogenesis.html"},
  {"id":"GlycolysisGluconeogenesisHomo","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"GlycolysisGluconeogenesisHomo","title":"Glycolysis and gluconeogenesis (Homo sapiens) - WikiPathways","type":"webpage","URL":"https://www.wikipathways.org/index.php/Pathway:WP534"},
  {"id":"GlycolysisReactions","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"GlycolysisReactions","title":"Glycolysis Reactions","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/601glycolysisrx.html"},
  {"id":"GlycolysisSummary","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"GlycolysisSummary","title":"Glycolysis Summary","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/601glycolysissum.html"},
  {"id":"haggstromMedicalGalleryMikael2014","accessed":{"date-parts":[[2022,6,22]]},"author":[{"family":"Häggström","given":"Mikael"}],"citation-key":"haggstromMedicalGalleryMikael2014","container-title":"WikiJournal of Medicine","container-title-short":"Wiki J Med","DOI":"10.15347/wjm/2014.008","ISSN":"20024436","issue":"2","issued":{"date-parts":[[2014]]},"source":"DOI.org (Crossref)","title":"Medical gallery of Mikael Häggström 2014","type":"article-journal","URL":"https://en.wikiversity.org/wiki/WikiJournal_of_Medicine/Medical_gallery_of_Mikael_H%C3%A4ggstr%C3%B6m_2014","volume":"1"},
  {"id":"Hemiacetal2022","abstract":"A hemiacetal or a hemiketal have the general formula R1R2C(OH)OR, where R1 or R2 is hydrogen or an organic substituent. They generally result from the addition of an alcohol to an aldehyde or a ketone, although the latter are sometimes called hemiketals. Most sugars are hemiacetals.","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"Hemiacetal2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,1,5]]},"language":"en","note":"Page Version ID: 1063866463","source":"Wikipedia","title":"Hemiacetal","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Hemiacetal&oldid=1063866463"},
  {"id":"hollyEsterFormation2013","abstract":"YouTube Video Editor","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"hollyEsterFormation2013","dimensions":"1:29","director":[{"literal":"Holly"}],"issued":{"date-parts":[[2013,6,3]]},"source":"YouTube","title":"Ester Formation","type":"motion_picture","URL":"https://www.youtube.com/watch?v=BitnDbEZvMY"},
  {"id":"HydrogenBond2022","abstract":"A hydrogen bond (or H-bond) is a primarily electrostatic force of attraction between a hydrogen (H) atom which is covalently bound to a more electronegative \"donor\" atom or group, and another electronegative atom bearing a lone pair of electrons—the hydrogen bond acceptor (Ac). Such an interacting system is generally denoted Dn–H···Ac, where the solid line denotes a polar covalent bond, and the dotted or dashed line indicates the hydrogen bond. The most frequent donor and acceptor atoms are the second-row elements nitrogen (N), oxygen (O), and fluorine (F).\nHydrogen bonds can be intermolecular (occurring between separate molecules) or intramolecular (occurring among parts of the same molecule). The energy of a hydrogen bond depends on the geometry, the environment, and the nature of the specific donor and acceptor atoms, and can vary between 1 and 40 kcal/mol. This makes them somewhat stronger than a van der Waals interaction, and weaker than fully covalent or ionic bonds. This type of bond can occur in inorganic molecules such as water and in organic molecules like DNA and proteins. Hydrogen bonds are responsible for holding such materials as paper and felted wool together, and for causing separate sheets of paper to stick together after becoming wet and subsequently drying.\nThe hydrogen bond is responsible for many of the abnormal physical and chemical properties of compounds of N, O, and F.  In particular, intermolecular hydrogen bonding is responsible for the high boiling point of water (100 °C) compared to the other group-16 hydrides that have much weaker hydrogen bonds. Intramolecular hydrogen bonding is partly responsible for the secondary and tertiary structures of proteins and nucleic acids. It also plays an important role in the structure of polymers, both synthetic and natural.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"HydrogenBond2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,9]]},"language":"en","note":"Page Version ID: 1092324103","source":"Wikipedia","title":"Hydrogen bond","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Hydrogen_bond&oldid=1092324103"},
  {"id":"Hydrolysis2022","abstract":"Hydrolysis (; from Ancient Greek  hydro- 'water', and  lysis 'to unbind') is any chemical reaction in which a molecule of water breaks one or more chemical bonds. The term is used broadly for substitution, elimination, and solvation reactions in which water is the nucleophile.Biological hydrolysis is the cleavage of biomolecules where a water molecule is consumed to effect the separation of a larger molecule into component parts. When a carbohydrate is broken into its component sugar molecules by hydrolysis (e.g., sucrose being broken down into glucose and fructose), this is recognized as saccharification.Hydrolysis reactions can be the reverse of a condensation reaction in which two molecules join into a larger one and eject a water molecule. Thus hydrolysis adds water to break down, whereas condensation builds up by removing water.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Hydrolysis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,27]]},"language":"en","note":"Page Version ID: 1084951022","source":"Wikipedia","title":"Hydrolysis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Hydrolysis&oldid=1084951022"},
  {"id":"HydroxyGroup2022","abstract":"A hydroxy or hydroxyl group is a functional group with the chemical formula -OH and composed of one oxygen atom covalently bonded to one hydrogen atom. In organic chemistry, alcohols and carboxylic acids contain one or more hydroxy groups. Both the negatively charged anion HO−, called hydroxide, and the neutral radical HO•, known as the hydroxyl radical, consist of an unbonded hydroxyl group.\nAccording to IUPAC definitions, the term hydroxyl refers to the hydroxyl radical (·OH) only, while the functional group −OH is called hydroxy group.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"HydroxyGroup2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,26]]},"language":"en","note":"Page Version ID: 1089987791","source":"Wikipedia","title":"Hydroxy group","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Hydroxy_group&oldid=1089987791"},
  {"id":"IdMeaningDefinition","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"IdMeaningDefinition","language":"en","title":"id: Meaning and Definition of | Infoplease","title-short":"id","type":"webpage","URL":"https://www.infoplease.com/dictionary/id"},
  {"id":"IllustratedGlossaryOrganic","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"IllustratedGlossaryOrganic","title":"Illustrated Glossary of Organic Chemistry - Anhydride; acid anhydride; mixed anhydride","type":"webpage","URL":"http://www.chem.ucla.edu/~harding/IGOC/A/anhydride.html"},
  {"id":"InheritedMetabolicDisorders2021","abstract":"The field of inherited disorders of the nervous system has undergone major revolutions in the past 150 years. The 19th century saw the first systemic approach to disease through the use of rational, consistent outlines for taking histories and doing physical examinations.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"InheritedMetabolicDisorders2021","issued":{"literal":"2021-11-24-12:53"},"note":"Publication: Medscape - eMedicine","source":"eMedicine","title":"Inherited Metabolic Disorders: Overview, Clinical Features and Differential Diagnosis, Epidemiology and Statistics","title-short":"Inherited Metabolic Disorders","type":"article-journal","URL":"https://emedicine.medscape.com/article/1183253-overview?reg=1"},
  {"id":"Ion2022","abstract":"An ion () is an atom or molecule with a net electrical charge.\nThe charge of an electron is considered to be negative by convention and this charge is equal and opposite to the charge of a proton, which is considered to be positive by convention. The net charge of an ion is not zero because its total number of electrons is unequal to its total number of protons.\nA cation is a positively charged ion with fewer electrons than protons while an anion is a negatively charged ion with more electrons than protons. Opposite electric charges are pulled towards one another by electrostatic force, so cations and anions attract each other and readily form ionic compounds.\nIons consisting of only a single atom are termed atomic or monatomic ions, while two or more atoms form molecular ions or polyatomic ions. In the case of physical ionization in a fluid (gas or liquid), \"ion pairs\" are created by spontaneous molecule collisions, where each generated pair consists of a free electron and a positive ion. Ions are also created by chemical interactions, such as the dissolution of a salt in liquids, or by other means, such as passing a direct current through a conducting solution, dissolving an anode via ionization.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"Ion2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,25]]},"language":"en","note":"Page Version ID: 1089733609","source":"Wikipedia","title":"Ion","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ion&oldid=1089733609"},
  {"id":"Isomer2022","abstract":"In chemistry, isomers are molecules or polyatomic ions with identical molecular formulae – that is, same number of atoms of each element – but distinct arrangements of atoms in space. Isomerism is existence or possibility of isomers.\nIsomers do not necessarily share similar chemical or physical properties. Two main forms of isomerism are structural or constitutional isomerism, in which bonds between the atoms differ; and stereoisomerism or spatial isomerism, in which the bonds are the same but the relative positions of the atoms differ.\nIsomeric relationships form a hierarchy. Two chemicals might be the same constitutional isomer, but upon deeper analysis be stereoisomers of each other. Two molecules that are the same stereoisomer as each other might be in different conformational forms or be different isotopologues. The depth of analysis depends on the field of study or the chemical and physical properties of interest.\nThe English word \"isomer\" () is a back-formation from \"isomeric\", which was borrowed through German isomerisch from Swedish isomerisk; which in turn was coined from Greek ἰσόμερoς  isómeros, with roots isos = \"equal\",  méros = \"part\".","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Isomer2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,30]]},"language":"en","note":"Page Version ID: 1090688309","source":"Wikipedia","title":"Isomer","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Isomer&oldid=1090688309"},
  {"id":"Isomerization2022","abstract":"In chemistry isomerization or isomerisation is the process in which a molecule, ion or molecular fragment is transformed into an isomer with a different chemical structure. Enolization is an example of isomerization, as is tautomerization. When the isomerization occurs intramolecularly it may be called a rearrangement reaction.When the activation energy for the isomerization reaction is sufficiently small, both isomers will exist in a temperature-dependent equilibrium with each other. Many values of the standard free energy difference, \n  \n    \n      \n        Δ\n        \n          G\n          \n            ∘\n          \n        \n      \n    \n    {\\displaystyle \\Delta G^{\\circ }}\n  , have been calculated, with good agreement between observed and calculated data.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Isomerization2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,28]]},"language":"en","note":"Page Version ID: 1090334180","source":"Wikipedia","title":"Isomerization","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Isomerization&oldid=1090334180"},
  {"id":"Ketogenesis2022","abstract":"Ketogenesis is the biochemical process through which organisms produce ketone bodies by breaking down fatty acids and ketogenic amino acids. The process supplies energy  to certain organs, particularly the brain, heart and skeletal muscle, under specific scenarios including fasting, caloric restriction, sleep, or others. (In rare metabolic diseases, insufficient gluconeogenesis can cause excessive ketogenesis and hypoglycemia, which may lead to the life-threatening condition known as non-diabetic ketoacidosis.)Ketone bodies are not obligately produced from fatty acids; rather a meaningful amount of them is synthesized only in a situation of carbohydrate and protein insufficiency, where only fatty acids are readily available as fuel for their production.","accessed":{"date-parts":[[2022,6,17]]},"citation-key":"Ketogenesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,10]]},"language":"en","note":"Page Version ID: 1092473401","source":"Wikipedia","title":"Ketogenesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ketogenesis&oldid=1092473401"},
  {"id":"Ketone2022","abstract":"In chemistry, a ketone  is a functional group with the structure R2C=O, where R can be a variety of carbon-containing substituents. Ketones contain a carbonyl group (a carbon-oxygen double bond). The simplest ketone is acetone (R = R' = methyl), with the formula CH3C(O)CH3. Many ketones are of great importance in biology and in industry. Examples include many sugars (ketoses), many steroids (e.g., testosterone), and the solvent acetone.","accessed":{"date-parts":[[2022,6,17]]},"citation-key":"Ketone2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,9]]},"language":"en","note":"Page Version ID: 1087036856","source":"Wikipedia","title":"Ketone","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ketone&oldid=1087036856"},
  {"id":"KetoneBodies2022","abstract":"Ketone bodies are water-soluble molecules that contain the ketone groups produced from fatty acids by the liver (ketogenesis). Ketone bodies are readily transported into tissues outside the liver, where they are converted into acetyl-CoA (acetyl-Coenzyme A)—which then enters the citric acid cycle (Krebs cycle) and is oxidized for energy.  These liver-derived ketone groups include acetoacetic acid (acetoacetate), beta-hydroxybutyrate, and acetone, a spontaneous breakdown product of acetoacetate (see graphic).\nKetone bodies are produced by the liver during periods of caloric restriction of various scenarios: low food intake (fasting), carbohydrate restrictive diets, starvation, prolonged intense exercise, alcoholism, or during untreated (or inadequately treated) type 1 diabetes mellitus. Ketone bodies are produced in liver cells by the breakdown of fatty acids. They are released into the blood after glycogen stores in the liver have been depleted. (Glycogen stores typically are depleted within the first 24 hours of fasting.)Ketone bodies are also produced in glial cells under periods of food restriction to sustain memory formation When two acetyl-CoA molecules lose their -CoAs (or coenzyme A groups), they can form a (covalent) dimer called acetoacetate. β-hydroxybutyrate is a reduced form of acetoacetate, in which the ketone group is converted into an alcohol (or hydroxyl) group (see illustration on the right). Both are 4-carbon molecules that can readily be converted back into acetyl-CoA by most tissues of the body, with the notable exception of the liver. Acetone is the decarboxylated form of acetoacetate which cannot be converted back into acetyl-CoA except via detoxification in the liver where it is converted into lactic acid, which can, in turn, be oxidized into pyruvic acid, and only then into acetyl-CoA.\nKetone bodies have a characteristic smell, which can easily be detected in the breath of persons in ketosis and ketoacidosis. It is often described as fruity or like nail polish remover (which usually contains acetone or ethyl acetate).\nApart from the three endogenous ketone bodies, other ketone bodies like β-ketopentanoate and β-hydroxypentanoate may be created as a result of the metabolism of synthetic triglycerides, such as triheptanoin.","accessed":{"date-parts":[[2022,6,17]]},"citation-key":"KetoneBodies2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,17]]},"language":"en","note":"Page Version ID: 1088359278","source":"Wikipedia","title":"Ketone bodies","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ketone_bodies&oldid=1088359278"},
  {"id":"Ketose2021","abstract":"A ketose is a monosaccharide containing one ketone group per molecule. The simplest ketose is dihydroxyacetone, which has only three carbon atoms, and it is the only one with no optical activity. All monosaccharide ketoses are reducing sugars, because they can tautomerize into aldoses via an enediol intermediate, and the resulting aldehyde group can be oxidised, for example in the Tollens' test or Benedict's test. Ketoses that are bound into glycosides, for example in the case of the fructose moiety of sucrose, are nonreducing sugars.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Ketose2021","container-title":"Wikipedia","issued":{"date-parts":[[2021,12,2]]},"language":"en","note":"Page Version ID: 1058259022","source":"Wikipedia","title":"Ketose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ketose&oldid=1058259022"},
  {"id":"Ketose2021a","abstract":"A ketose is a monosaccharide containing one ketone group per molecule. The simplest ketose is dihydroxyacetone, which has only three carbon atoms, and it is the only one with no optical activity. All monosaccharide ketoses are reducing sugars, because they can tautomerize into aldoses via an enediol intermediate, and the resulting aldehyde group can be oxidised, for example in the Tollens' test or Benedict's test. Ketoses that are bound into glycosides, for example in the case of the fructose moiety of sucrose, are nonreducing sugars.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Ketose2021a","container-title":"Wikipedia","issued":{"date-parts":[[2021,12,2]]},"language":"en","note":"Page Version ID: 1058259022","source":"Wikipedia","title":"Ketose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ketose&oldid=1058259022"},
  {"id":"klonoffFogComputingEdge2017","abstract":"The Internet of Things (IoT) is generating an immense volume of data. With cloud computing, medical sensor and actuator data can be stored and analyzed remotely by distributed servers. The results can then be delivered via the Internet. The number of devices in IoT includes such wireless diabetes devices as blood glucose monitors, continuous glucose monitors, insulin pens, insulin pumps, and closed-loop systems. The cloud model for data storage and analysis is increasingly unable to process the data avalanche, and processing is being pushed out to the edge of the network closer to where the data-generating devices are. Fog computing and edge computing are two architectures for data handling that can offload data from the cloud, process it nearby the patient, and transmit information machine-to-machine or machine-to-human in milliseconds or seconds. Sensor data can be processed near the sensing and actuating devices with fog computing (with local nodes) and with edge computing (within the sensing devices). Compared to cloud computing, fog computing and edge computing offer five advantages: (1) greater data transmission speed, (2) less dependence on limited bandwidths, (3) greater privacy and security, (4) greater control over data generated in foreign countries where laws may limit use or permit unwanted governmental access, and (5) lower costs because more sensor-derived data are used locally and less data are transmitted remotely. Connected diabetes devices almost all use fog computing or edge computing because diabetes patients require a very rapid response to sensor input and cannot tolerate delays for cloud computing.","accessed":{"date-parts":[[2022,4,28]]},"author":[{"family":"Klonoff","given":"David C."}],"citation-key":"klonoffFogComputingEdge2017","container-title":"Journal of Diabetes Science and Technology","container-title-short":"J Diabetes Sci Technol","DOI":"10.1177/1932296817717007","ISSN":"1932-2968","issue":"4","issued":{"date-parts":[[2017,7,1]]},"page":"647-652","publisher":"SAGE Publications Inc","source":"SAGE Journals","title":"Fog Computing and Edge Computing Architectures for Processing Data From Diabetes Devices Connected to the Medical Internet of Things","type":"article-journal","URL":"https://doi.org/10.1177/1932296817717007","volume":"11"},
  {"id":"kulkarniIsletVcell2004","abstract":"The ␤-cell is one of four major types of cells present in the islets of Langerhans, which are islands of cells distributed throughout the endocrine pancreas in most mammals. The ␤-cell synthesizes and secretes the hormone insulin mainly in response to glucose but also in response to several nutrients, hormones and nervous stimuli. In adult rodents the ␤-cell has a slow mitotic rate. Recent studies provide novel insights into the functions of the ␤-cell. The presence of functional insulin-like growth factor-1 and insulin receptors and components of their signaling pathway indicate an important role for insulin/IGF-1 signaling in the regulation of ␤-cell function. Further, the recent discovery of glucokinase (GK) and the ATP-dependent potassium channels on insulin secretory granules, the detection of AMP-protein kinase in the ␤-cell and the identiﬁcation of a new ␤-cell transcription factor, mMafA, are some exciting new areas of research currently underway to further understand the complex pathways that regulate the functions of ␤-cells.","accessed":{"date-parts":[[2022,6,5]]},"author":[{"family":"Kulkarni","given":"Rohit N"}],"citation-key":"kulkarniIsletVcell2004","container-title":"The International Journal of Biochemistry & Cell Biology","container-title-short":"The International Journal of Biochemistry & Cell Biology","DOI":"10.1016/j.biocel.2003.08.010","ISSN":"13572725","issue":"3","issued":{"date-parts":[[2004,3]]},"language":"en","page":"365-371","source":"DOI.org (Crossref)","title":"The islet β-cell","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1357272503002917","volume":"36"},
  {"id":"Lactose2022","abstract":"Lactose, a disaccharide, is a sugar composed of galactose and glucose subunits and has the molecular formula C12H22O11.  Lactose makes up around 2–8% of milk (by weight). The name comes from lac (gen. lactis), the Latin word for milk, plus the suffix -ose used to name sugars.  The compound is a white, water-soluble, non-hygroscopic solid with a mildly sweet taste.  It is used in the food industry.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Lactose2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,9]]},"language":"en","note":"Page Version ID: 1081753262","source":"Wikipedia","title":"Lactose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Lactose&oldid=1081753262"},
  {"id":"langChapterSixPediatric2014","abstract":"Hypoglycemia in the pediatric population is a common finding important to recognize and manage to prevent brain injury. Recent advances in molecular genetics have provided new insight into its biochemical and physiologic basis and have led to more appropriate and specific treatment. Although a major cause of brain injury in pediatrics, the ability to predict the long-term outcome in these patients remains difficult. Identification of these at-risk individuals is important. The physiologic adaptations associated with transition from fetal to neonatal life are now better understood thus allowing for improved surveillance and management. Despite these advances, analytical limitations of point-of-care testing instruments at low glucose concentration continue to persist. This review aims to address these questions and provide an overview of pediatric hypoglycemia and the molecular pathways involved.","accessed":{"date-parts":[[2022,6,5]]},"author":[{"family":"Lang","given":"Timothy F."},{"family":"Hussain","given":"Khalid"}],"citation-key":"langChapterSixPediatric2014","container-title":"Advances in Clinical Chemistry","DOI":"10.1016/B978-0-12-800094-6.00006-6","editor":[{"family":"Makowski","given":"Gregory S."}],"issued":{"date-parts":[[2014,1,1]]},"language":"en","page":"211-245","publisher":"Elsevier","source":"ScienceDirect","title":"Chapter Six - Pediatric Hypoglycemia","type":"chapter","URL":"https://www.sciencedirect.com/science/article/pii/B9780128000946000066","volume":"63"},
  {"id":"LetTalkScience","abstract":"We are all familiar with the term acid and we often hear about the pH scale, but what does it really mean? It is a delicate dance at the molecular level. Let's break it down.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"LetTalkScience","language":"en","title":"Let’s Talk Science: A pH Solution","title-short":"Let’s Talk Science","type":"webpage","URL":"https://ecology.wa.gov/Blog/Posts/February-2014/Let’s-Talk-Science-A-pH-Solution"},
  {"id":"levyTypeDiabetes2016","author":[{"family":"Levy","given":"David"}],"call-number":"RC660 .L48 2016","citation-key":"levyTypeDiabetes2016","collection-title":"Oxford diabetes library","edition":"Second edition","event-place":"Oxford, United Kingdom ; New York, NY, USA","ISBN":"978-0-19-876645-2","issued":{"date-parts":[[2016]]},"language":"en","note":"OCLC: ocn957691494","number-of-pages":"248","publisher":"Oxford University Press","publisher-place":"Oxford, United Kingdom ; New York, NY, USA","source":"Library of Congress ISBN","title":"Type 1 diabetes","type":"book"},
  {"id":"liebenTypeDiabetesMellitus2017","abstract":"Type 1 diabetes mellitus (T1DM) is a chronic disease characterized by insulin deficiency as a consequence of pancreatic β-cell loss. This PrimeView highlights the mechanisms underlying T1DM, including immunemediated pancreatic β-cell loss.","accessed":{"date-parts":[[2022,6,3]]},"author":[{"family":"Lieben","given":"Lisbet"}],"citation-key":"liebenTypeDiabetesMellitus2017","container-title":"Nature Reviews Disease Primers","container-title-short":"Nat Rev Dis Primers","DOI":"10.1038/nrdp.2017.17","ISSN":"2056-676X","issue":"1","issued":{"date-parts":[[2017,12]]},"language":"en","page":"17017","source":"DOI.org (Crossref)","title":"Type 1 diabetes mellitus","type":"article-journal","URL":"http://www.nature.com/articles/nrdp201717","volume":"3"},
  {"id":"Lipids","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"Lipids","title":"Lipids","type":"webpage","URL":"http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/lipid.html#c1"},
  {"id":"MainTypesAlcohol2020","abstract":"Chemistry, as a field, acknowledges three main types of alcohol: isopropyl, methyl, and ethyl alcohol. Each of these types of alcohol has different properties. Alcohols are those organic compounds. The presence of one, two or more hydroxyl groups (−OH) are the main characteristic of these compound.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"MainTypesAlcohol2020","container-title":"Toppr-guides","issued":{"date-parts":[[2020,3,2]]},"language":"en-US","section":"Solutions","title":"Main Types of Alcohol, Primary, Secondary and Tertiary Alcohols","type":"post-weblog","URL":"https://www.toppr.com/guides/chemistry/solutions/main-types-of-alcohol/"},
  {"id":"Maltose2022","abstract":"Maltose ( or ), also known as maltobiose or malt sugar, is a disaccharide formed from two units of glucose joined with an α(1→4) bond. In the isomer isomaltose, the two glucose molecules are joined with an α(1→6) bond. Maltose is the two-unit member of the amylose homologous series, the key structural motif of starch. When alpha-amylase breaks down starch, it removes two glucose units at a time, producing maltose. An example of this reaction is found in germinating seeds, which is why it was named after malt. Unlike sucrose, it is a reducing sugar.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Maltose2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,21]]},"language":"en","note":"Page Version ID: 1094234528","source":"Wikipedia","title":"Maltose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Maltose&oldid=1094234528"},
  {"id":"MedicalDictionaryHealth2011","abstract":"Online medical dictionary of health terms: J-P....","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MedicalDictionaryHealth2011","container-title":"Harvard Health","issued":{"date-parts":[[2011,12,13]]},"language":"en","title":"Medical Dictionary of Health Terms: J-P","title-short":"Medical Dictionary of Health Terms","type":"webpage","URL":"https://www.health.harvard.edu/j-through-p"},
  {"id":"MedicalDictionaryHealth2011a","abstract":"Online medical dictionary of health terms: A-C....","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MedicalDictionaryHealth2011a","container-title":"Harvard Health","issued":{"date-parts":[[2011,12,13]]},"language":"en","title":"Medical Dictionary of Health Terms: A-C","title-short":"Medical Dictionary of Health Terms","type":"webpage","URL":"https://www.health.harvard.edu/a-through-c"},
  {"id":"meisenbergPrinciplesMedicalBiochemistry","author":[{"family":"Meisenberg","given":"Gerhard"},{"family":"Simmons","given":"William H"}],"citation-key":"meisenbergPrinciplesMedicalBiochemistry","language":"en","page":"635","source":"Zotero","title":"Principles of Medical Biochemistry","type":"article-journal"},
  {"id":"meisenbergPrinciplesMedicalBiochemistrya","author":[{"family":"Meisenberg","given":"Gerhard"},{"family":"Simmons","given":"William H"}],"citation-key":"meisenbergPrinciplesMedicalBiochemistrya","language":"en","page":"635","source":"Zotero","title":"Principles of Medical Biochemistry","type":"article-journal"},
  {"id":"melkamuEpimersAnomers2020","abstract":"Epimers are diastereomers that differ in the configuration of only one chiral center. Anomers are epimers of cyclic carbohydrates.","accessed":{"date-parts":[[2022,6,21]]},"author":[{"literal":"melkamu"}],"citation-key":"melkamuEpimersAnomers2020","container-title":"Chemistry Steps","issued":{"date-parts":[[2020,12,2]]},"language":"en-US","title":"Epimers and Anomers","type":"webpage","URL":"https://www.chemistrysteps.com/epimers-and-anomers/"},
  {"id":"MetabolicDisorders","abstract":"Your metabolism makes energy from the food you eat. A metabolic disorder disrupts this process. One example is diabetes. Learn more.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MetabolicDisorders","genre":"Text","language":"eng","publisher":"National Library of Medicine","title":"Metabolic Disorders","type":"webpage","URL":"https://medlineplus.gov/metabolicdisorders.html"},
  {"id":"MetabolicSyndrome2017","abstract":"Find out what metabolic syndrome is, what the symptoms and risk factors are, and what you can do to reverse or prevent it.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MetabolicSyndrome2017","container-title":"nhs.uk","issued":{"literal":"19 Oct 2017, 12:49 p.m."},"language":"en","section":"conditions","title":"Metabolic syndrome","type":"webpage","URL":"https://www.nhs.uk/conditions/metabolic-syndrome/"},
  {"id":"MetabolicSyndromeSymptoms","abstract":"Having three or more specific risk factors, such as high blood pressure or abdominal fat, boosts your risk of type 2 diabetes and heart disease.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MetabolicSyndromeSymptoms","container-title":"Mayo Clinic","language":"en","title":"Metabolic syndrome - Symptoms and causes","type":"webpage","URL":"https://www.mayoclinic.org/diseases-conditions/metabolic-syndrome/symptoms-causes/syc-20351916"},
  {"id":"millerProteinSynthesis2020","accessed":{"date-parts":[[2022,6,16]]},"author":[{"family":"Miller","given":"Christine"}],"citation-key":"millerProteinSynthesis2020","issued":{"date-parts":[[2020,9,1]]},"language":"en","publisher":"Thompson Rivers University","source":"humanbiology.pressbooks.tru.ca","title":"5.7 Protein Synthesis","type":"article-journal","URL":"https://humanbiology.pressbooks.tru.ca/chapter/5-6-protein-synthesis/"},
  {"id":"MonosaccharideAufbauBeispiele","abstract":"Monosaccharide: Definition und einfach erklärt ✅ Aufbau und Struktur ✅ Monosaccharide Beispiele ✅ mit kostenlosem Video","accessed":{"date-parts":[[2022,6,21]]},"citation-key":"MonosaccharideAufbauBeispiele","container-title":"Studyflix","language":"de","title":"Monosaccharide • Aufbau, Beispiele","type":"webpage","URL":"https://studyflix.de/chemie/monosaccharide-2393"},
  {"id":"nathanTranslatingA1CAssay2008","abstract":"OBJECTIVE — The A1C assay, expressed as the percent of hemoglobin that is glycated, measures chronic glycemia and is widely used to judge the adequacy of diabetes treatment and adjust therapy. Day-to-day management is guided by self-monitoring of capillary glucose concentrations (milligrams per deciliter or millimoles per liter). We sought to deﬁne the mathematical relationship between A1C and average glucose (AG) levels and determine whether A1C could be expressed and reported as AG in the same units as used in self-monitoring. RESEARCH DESIGN AND METHODS — A total of 507 subjects, including 268 patients with type 1 diabetes, 159 with type 2 diabetes, and 80 nondiabetic subjects from 10 international centers, was included in the analyses. A1C levels obtained at the end of 3 months and measured in a central laboratory were compared with the AG levels during the previous 3 months. AG was calculated by combining weighted results from at least 2 days of continuous glucose monitoring performed four times, with seven-point daily self-monitoring of capillary (ﬁngerstick) glucose performed at least 3 days per week.\nRESULTS — Approximately 2,700 glucose values were obtained by each subject during 3 months. Linear regression analysis between the A1C and AG values provided the tightest correlations (AGmg/dl ϭ 28.7 ϫ A1C Ϫ 46.7, R2 ϭ 0.84, P Ͻ 0.0001), allowing calculation of an estimated average glucose (eAG) for A1C values. The linear regression equations did not differ signiﬁcantly across subgroups based on age, sex, diabetes type, race/ethnicity, or smoking status.\nCONCLUSIONS — A1C levels can be expressed as eAG for most patients with type 1 and type 2 diabetes.","accessed":{"date-parts":[[2022,4,27]]},"author":[{"family":"Nathan","given":"David M."},{"family":"Kuenen","given":"Judith"},{"family":"Borg","given":"Rikke"},{"family":"Zheng","given":"Hui"},{"family":"Schoenfeld","given":"David"},{"family":"Heine","given":"Robert J."},{"literal":"for the A1c-Derived Average Glucose (ADAG) Study Group"}],"citation-key":"nathanTranslatingA1CAssay2008","container-title":"Diabetes Care","DOI":"10.2337/dc08-0545","ISSN":"0149-5992, 1935-5548","issue":"8","issued":{"date-parts":[[2008,8,1]]},"language":"en","page":"1473-1478","source":"DOI.org (Crossref)","title":"Translating the A1C Assay Into Estimated Average Glucose Values","type":"article-journal","URL":"https://diabetesjournals.org/care/article/31/8/1473/28589/Translating-the-A1C-Assay-Into-Estimated-Average","volume":"31"},
  {"id":"Nomenclature","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"Nomenclature","title":"Nomenclature","type":"webpage","URL":"https://chemed.chem.purdue.edu/genchem/topicreview/bp/ch2/names.html"},
  {"id":"OrganicAcidAnhydride2022","abstract":"An organic acid anhydride is an acid anhydride that is an organic compound. An acid anhydride is a compound that has two acyl groups bonded to the same oxygen atom. A common type of organic acid anhydride is a carboxylic anhydride, where the parent acid is a carboxylic acid, the formula of the anhydride being (RC(O))2O. Symmetrical acid anhydrides of this type are named by replacing the word acid in the name of the parent carboxylic acid by the word anhydride. Thus, (CH3CO)2O is called acetic anhydride. Mixed (or unsymmetrical) acid anhydrides, such as acetic formic anhydride (see below), are known, whereby reaction occurs between two different carboxylic acids. Nomenclature of unsymmetrical acid anhydrides list the names of both of the reacted carboxylic acids before the word \"anhydride\" (for example, the dehydration reaction between benzoic acid and propanoic acid would yield \"benzoic propanoic anhydride\").One or both acyl groups of an acid anhydride may also be derived from another type of organic acid, such as sulfonic acid or a phosphonic acid. One of the acyl groups of an acid anhydride can be derived from an inorganic acid such as phosphoric acid. The mixed anhydride 1,3-bisphosphoglyceric acid, an intermediate in the formation of ATP via glycolysis, is the mixed anhydride of 3-phosphoglyceric acid and phosphoric acid. Acidic oxides are also classified as acid anhydrides.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"OrganicAcidAnhydride2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,22]]},"language":"en","note":"Page Version ID: 1089152388","source":"Wikipedia","title":"Organic acid anhydride","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Organic_acid_anhydride&oldid=1089152388"},
  {"id":"OrganicCompound2022","abstract":"In chemistry, organic compounds are generally any chemical compounds that contain carbon-hydrogen or carbon-carbon bonds.  Due to carbon's ability to catenate (form chains with other carbon atoms), millions of organic compounds are known. The study of the properties, reactions, and syntheses of organic compounds comprise the discipline known as organic chemistry.  For historical reasons, a few classes of carbon-containing compounds (e.g., carbonate salts and cyanide salts), along with a few other exceptions (e.g., carbon dioxide), are not classified as organic compounds and are considered inorganic.  Other than those just named, little consensus exists among chemists on precisely which carbon-containing compounds are excluded, making any rigorous definition of an organic compound elusive.Although organic compounds make up only a small percentage of Earth's crust, they are of central importance because all known life is based on organic compounds. Living things incorporate inorganic carbon compounds into organic compounds through a network of processes (the carbon cycle) that begins with the conversion of carbon dioxide and a hydrogen source like water into  simple sugars and other organic molecules by autotrophic organisms using light (photosynthesis) or other sources of energy.  Most synthetically-produced organic compounds are ultimately derived from petrochemicals consisting mainly of hydrocarbons, which are themselves formed from the high pressure and temperature degradation of organic matter underground over geological timescales.  This ultimate derivation notwithstanding, organic compounds are no longer defined as compounds originating in living things, as they were historically.\nIn chemical nomenclature, an organyl group, frequently represented by the letter R, refers to any monovalent substituent whose open valence is on a carbon atom.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"OrganicCompound2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,7]]},"language":"en","note":"Page Version ID: 1091904588","source":"Wikipedia","title":"Organic compound","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Organic_compound&oldid=1091904588"},
  {"id":"OverviewCarbohydrateMetabolism","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"OverviewCarbohydrateMetabolism","title":"Overview of Carbohydrate Metabolism","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/600glycolysis.html"},
  {"id":"OverviewCitricAcid","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"OverviewCitricAcid","title":"Overview Citric Acid Cycle","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/610citricac.html"},
  {"id":"OverviewMetabolism","accessed":{"date-parts":[[2022,6,7]]},"citation-key":"OverviewMetabolism","title":"Overview Metabolism","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/5900verviewmet.html"},
  {"id":"OxidationReduction","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"OxidationReduction","title":"Oxidation and Reduction","type":"webpage","URL":"https://chemed.chem.purdue.edu/genchem/topicreview/bp/ch9/redox.php"},
  {"id":"OxidationState2022","abstract":"In chemistry, the oxidation state, or oxidation number, is the hypothetical charge of an atom if all of its bonds to different atoms were fully ionic. It describes the degree of oxidation (loss of electrons) of an atom in a chemical compound. Conceptually, the oxidation state may be positive, negative or zero. While fully ionic bonds are not found in nature, many bonds exhibit strong ionicity, making oxidation state a useful predictor of charge.\nThe oxidation state of an atom does not represent the \"real\" formal charge on that atom, or any other actual atomic property. This is particularly true of high oxidation states, where the ionization energy required to produce a multiply positive ion is far greater than the energies available in chemical reactions. Additionally, the oxidation states of atoms in a given compound may vary depending on the choice of electronegativity scale used in their calculation. Thus, the oxidation state of an atom in a compound is purely a formalism. It is nevertheless important in understanding the nomenclature conventions of inorganic compounds. Also, several observations regarding chemical reactions may be explained at a basic level in terms of oxidation states.\nOxidation states are typically represented by integers which may be positive, zero, or negative. In some cases, the average oxidation state of an element is a fraction, such as 8/3 for iron in magnetite Fe3O4 (see below). The highest known oxidation state is reported to be +9 in the tetroxoiridium(IX) cation (IrO+4). It is predicted that even a +12 oxidation state may be achievable by uranium in the unusual hexoxide UO6. The lowest oxidation state is −5, as for boron in Al3BC.In inorganic nomenclature, the oxidation state is represented by a Roman numeral placed after the element name inside the parenthesis or as a superscript after the element symbol, e.g. Iron(III) oxide.\nThe term oxidation was first used by Antoine Lavoisier to signify the reaction of a substance with oxygen. Much later, it was realized that the substance, upon being oxidized, loses electrons, and the meaning was extended to include other reactions in which electrons are lost, regardless of whether oxygen was involved.\nThe increase in the oxidation state of an atom, through a chemical reaction, is known as oxidation; a decrease in oxidation state is known as a reduction. Such reactions involve the formal transfer of electrons: a net gain in electrons being a reduction, and a net loss of electrons being oxidation. For pure elements, the oxidation state is zero.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"OxidationState2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,18]]},"language":"en","note":"Page Version ID: 1093769690","source":"Wikipedia","title":"Oxidation state","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Oxidation_state&oldid=1093769690"},
  {"id":"Oxyacid2021","abstract":"An oxyacid, oxoacid, or ternary acid is an acid that contains oxygen. Specifically, it is a compound that contains hydrogen, oxygen, and at least one other element, with at least one hydrogen atom bonded to oxygen that can dissociate to produce the H+ cation and the anion of the acid.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Oxyacid2021","container-title":"Wikipedia","issued":{"date-parts":[[2021,11,25]]},"language":"en","note":"Page Version ID: 1057043164","source":"Wikipedia","title":"Oxyacid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Oxyacid&oldid=1057043164"},
  {"id":"Pancreas2022","abstract":"The pancreas is an organ of the digestive system and endocrine system of vertebrates. In humans, it is located in the abdomen behind the stomach and functions as a gland. The pancreas is a mixed or heterocrine gland, i.e. it has both an endocrine and a digestive exocrine function. 99% of the pancreas is exocrine and 1% is endocrine. As an endocrine gland, it functions mostly to regulate blood sugar levels, secreting the hormones insulin, glucagon, somatostatin, and pancreatic polypeptide. As a part of the digestive system, it functions as an exocrine gland secreting pancreatic juice into the duodenum through the pancreatic duct. This juice contains bicarbonate, which neutralizes acid entering the duodenum from the stomach; and digestive enzymes, which break down carbohydrates, proteins, and fats in food entering the duodenum from the stomach.\nInflammation of the pancreas is known as pancreatitis, with common causes including chronic alcohol use and gallstones. Because of its role in the regulation of blood sugar, the pancreas is also a key organ in diabetes mellitus. Pancreatic cancer can arise following chronic pancreatitis or due to other reasons, and carries a very poor prognosis, as it is often identified when it has spread to other areas of the body.\nThe word pancreas comes from the Greek πᾶν (pân, “all”) & κρέας (kréas, “flesh”). The function of the pancreas in diabetes has been known since at least 1889, with its role in insulin production identified in 1921.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Pancreas2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,16]]},"language":"en","note":"Page Version ID: 1088127206","source":"Wikipedia","title":"Pancreas","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Pancreas&oldid=1088127206"},
  {"id":"PancreaticBud2022","abstract":"The ventral and dorsal pancreatic buds (or pancreatic diverticula) are outgrowths of the duodenum during human embryogenesis. They join to form the adult pancreas.\nThe proximal portion of the dorsal pancreatic bud gives rise to the accessory pancreatic duct, while the distal portion of the dorsal pancreatic bud and ventral pancreatic bud give rise to the major pancreatic duct.\nThe ventral pancreatic bud develops into the pancreatic head and uncinate process.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"PancreaticBud2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,1,22]]},"language":"en","note":"Page Version ID: 1067165401","source":"Wikipedia","title":"Pancreatic bud","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Pancreatic_bud&oldid=1067165401"},
  {"id":"PancreaticBudOverview","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"PancreaticBudOverview","title":"Pancreatic Bud - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/medicine-and-dentistry/pancreatic-bud"},
  {"id":"PeptideBond2022","abstract":"In organic chemistry, a peptide bond is an amide type of covalent chemical bond linking two consecutive alpha-amino acids from C1 (carbon number one) of one alpha-amino acid and N2 (nitrogen number two) of another, along a peptide or protein chain.It can also be called a eupeptide bond to distinguish it from an isopeptide bond, which is another type of amide bond between two amino acids.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"PeptideBond2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,3,20]]},"language":"en","note":"Page Version ID: 1078147722","source":"Wikipedia","title":"Peptide bond","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Peptide_bond&oldid=1078147722"},
  {"id":"PhosphodiesterBond2021","abstract":"A phosphodiester bond occurs when exactly two of the hydroxyl groups in phosphoric acid react with hydroxyl groups on other molecules to form two ester bonds. The \"bond\" involves this linkage C-O-PO2−-O-C.  Discussion of phosphodiesters is dominated by their prevalence in DNA and RNA, but phosphodiesters occur in other biomolecules, e.g. acyl carrier proteins.\nPhosphodiester bonds make up the backbones of DNA and RNA. The phosphate is attached to the 5' carbon. The 3' carbon of one sugar is bonded to the 5' phosphate of the adjacent sugar. Specifically, the phosphodiester bond links the 3' carbon atom of one sugar molecule and the 5' carbon atom of another(hence the name, 3', 5' phosphodiester linkage ). These saccharide groups are derived from deoxyribose in DNA and ribose in RNA.  Phosphodiesters  are negatively charged at pH 7.  Repulsion between these negative charges influences the conformation of the polynucleic acids. The negative charge attracts histones, metal cations such as magnesium, and polyamines.\nIn order for the phosphodiester bond to be formed and the nucleotides to be joined, the tri-phosphate or di-phosphate forms of the nucleotide building blocks are broken apart to give off energy required to drive the enzyme-catalyzed reaction.Hydrolysis of phosphodiester bonds is catalyzed by phosphodiesterases, which are involved in repairing DNA sequences.The phosphodiester linkage between two ribonucleotides can be broken by alkaline hydrolysis, whereas the linkage between two deoxyribonucleotides is more stable under these conditions. The relative ease of RNA hydrolysis is an effect of the presence of the 2' hydroxyl group.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"PhosphodiesterBond2021","container-title":"Wikipedia","issued":{"date-parts":[[2021,9,17]]},"language":"en","note":"Page Version ID: 1044890374","source":"Wikipedia","title":"Phosphodiester bond","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Phosphodiester_bond&oldid=1044890374"},
  {"id":"PhosphoricAcid2022","abstract":"Phosphoric acid (orthophosphoric acid, monophosphoric acid or phosphoric(V) acid) is an inorganic compound with the chemical formula H3PO4. Phosphoric acid is a colorless solid, it is commonly encountered as an 85% aqueous solution, which is a colourless, odourless, and non-volatile syrupy liquid. It is a major industrial chemical, being a component of many fertilizers.\nThe compound is an acid. Removal of all three H+ ions gives the phosphate ion PO3−4. Removal of one or two protons gives dihydrogen phosphate ion H2PO−4, and the hydrogen phosphate ion HPO2−4, respectively. Phosphoric acid forms esters, called organophosphates.The name \"orthophosphoric acid\" can be used to distinguish this specific acid from other \"phosphoric acids\", such as pyrophosphoric acid. Nevertheless, the term \"phosphoric acid\" often means this specific compound; and that is the current IUPAC nomenclature.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"PhosphoricAcid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,30]]},"language":"en","note":"Page Version ID: 1090604545","source":"Wikipedia","title":"Phosphoric acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Phosphoric_acid&oldid=1090604545"},
  {"id":"Polymer2022","abstract":"A polymer (; Greek poly-, \"many\" + -mer, \"part\")\nis a substance or material consisting of very large molecules, or macromolecules, composed of many repeating subunits. Due to their broad spectrum of properties, both synthetic and natural polymers play essential and ubiquitous roles in everyday life. Polymers range from familiar synthetic plastics such as polystyrene to natural biopolymers such as DNA and proteins that are fundamental to biological structure and function. Polymers, both natural and synthetic, are created via polymerization of many small molecules, known as monomers. Their consequently large molecular mass, relative to small molecule compounds, produces unique physical properties including toughness, high elasticity, viscoelasticity, and a tendency to form amorphous and semicrystalline structures rather than crystals.\nThe term \"polymer\" derives from the Greek word πολύς (polus, meaning \"many, much\") and μέρος (meros, meaning \"part\"). The term was coined in 1833 by Jöns Jacob Berzelius, though with a definition distinct from the modern IUPAC definition. The modern concept of polymers as covalently bonded macromolecular structures was proposed in 1920 by Hermann Staudinger, who spent the next decade finding experimental evidence for this hypothesis.Polymers are studied in the fields of polymer science (which includes polymer chemistry and polymer physics), biophysics and materials science and engineering. Historically, products arising from the linkage of repeating units by covalent chemical bonds have been the primary focus of polymer science. An emerging important area now focuses on supramolecular polymers formed by non-covalent links. Polyisoprene of latex rubber is an example of a natural polymer, and the polystyrene of styrofoam is an example of a synthetic polymer. In biological contexts, essentially all biological macromolecules—i.e., proteins (polyamides), nucleic acids (polynucleotides), and polysaccharides—are purely polymeric, or are composed in large part of polymeric components.","accessed":{"date-parts":[[2022,6,19]]},"citation-key":"Polymer2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,3]]},"language":"en","note":"Page Version ID: 1080796239","source":"Wikipedia","title":"Polymer","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Polymer&oldid=1080796239"},
  {"id":"ProteinBiosynthesis2022","abstract":"Protein biosynthesis (or protein synthesis) is a core biological process, occurring inside cells, balancing the loss of cellular proteins (via degradation or export) through the production of new proteins. Proteins perform a number of critical functions as enzymes, structural proteins or hormones. Protein synthesis is a very similar process for both prokaryotes and eukaryotes but there are some distinct differences.Protein synthesis can be divided broadly into two phases - transcription and translation. During transcription, a section of DNA encoding a protein, known as a gene, is converted into a template molecule called messenger RNA (mRNA). This conversion is carried out by enzymes, known as RNA polymerases, in the nucleus of the cell. In eukaryotes, this mRNA is initially produced in a premature form (pre-mRNA) which undergoes post-transcriptional modifications to produce mature mRNA. The mature mRNA is exported from the cell nucleus via nuclear pores to the cytoplasm of the cell for translation to occur. During translation, the mRNA is read by ribosomes which use the nucleotide sequence of the mRNA to determine the sequence of amino acids. The ribosomes catalyze the formation of covalent peptide bonds between the encoded amino acids to form a polypeptide chain.\nFollowing translation the polypeptide chain must fold to form a functional protein; for example, to function as an enzyme the polypeptide chain must fold correctly to produce a functional active site. In order to adopt a functional three-dimensional (3D) shape, the polypeptide chain must first form a series of smaller underlying structures called secondary structures. The polypeptide chain in these secondary structures then folds to produce the overall 3D tertiary structure. Once correctly folded, the protein can undergo further maturation through different post-translational modifications. Post-translational modifications can alter the protein's ability to function, where it is located within the cell (e.g. cytoplasm or nucleus) and the protein's ability to interact with other proteins.Protein biosynthesis has a key role in disease as changes and errors in this process, through underlying DNA mutations or protein misfolding, are often the underlying causes of a disease. DNA mutations change the subsequent mRNA sequence, which then alters the mRNA encoded amino acid sequence. Mutations can cause the polypeptide chain to be shorter by generating a stop sequence which causes early termination of translation. Alternatively, a mutation in the mRNA sequence changes the specific amino acid encoded at that position in the polypeptide chain. This amino acid change can impact the protein's ability to function or to fold correctly. Misfolded proteins are often implicated in disease as improperly folded proteins have a tendency to stick together to form dense protein clumps. These clumps are linked to a range of diseases, often neurological, including Alzheimer's disease and Parkinson's disease.","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ProteinBiosynthesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,24]]},"language":"en","note":"Page Version ID: 1089467579","source":"Wikipedia","title":"Protein biosynthesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Protein_biosynthesis&oldid=1089467579"},
  {"id":"ProteinMatabolism","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ProteinMatabolism","title":"Protein Matabolism","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/630proteinmet.html"},
  {"id":"ProteinSynthesisOverview","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ProteinSynthesisOverview","title":"Protein Synthesis - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/medicine-and-dentistry/protein-synthesis"},
  {"id":"Purine2022","abstract":"Purine is a heterocyclic aromatic organic compound that consists of two rings (pyrimidine and imidazole) fused together. It is water-soluble. Purine also gives its name to the wider class of molecules, purines, which include substituted purines and their tautomers. They are the most widely occurring nitrogen-containing heterocycles in nature.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Purine2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,14]]},"language":"en","note":"Page Version ID: 1093142817","source":"Wikipedia","title":"Purine","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Purine&oldid=1093142817"},
  {"id":"pustokhinaEffectiveTrainingScheme2020","abstract":"At present times, the real-time requirement on the multiaccess healthcare monitoring system, information mining, and efficient disease diagnosis of health conditions is a difficult process. The recent advances in information technology and the internet of medical things (IoMT) have fostered extensive utilization of the smart system. A complex, 24/7 healthcare service is needed for effective and trustworthy monitoring of patients on a daily basis. To accomplish this need, edge computing and cloud platforms are highly required to satisfy the requirements of smart healthcare systems. This paper presents a new effective training scheme for the deep neural network (DNN), called ETS-DNN model in edge computing enabled IoMT system. The proposed ETS-DNN intends to facilitate timely data collection and processing to make timely decisions using the patterns that exist in the data. Initially, the IoMT devices sense the patient's data and transfer the captured data to edge computing, which executes the ETS-DNN model to diagnose it. The proposed ETS-DNN model incorporates a Hybrid Modified Water Wave Optimization (HMWWO) technique to tune the parameters of the DNN structure, which comprises of several autoencoder layers cascaded to a softmax (SM) layer. The SM classification layer is placed at the end of the DNN to perform the classification task. The HMWWO algorithm integrates the MWWO technique with limited memory Broyden-Fletcher-Goldfarb-Shannon (L-BFGS). Once the ETS-DNN model generates the report in edge computing, then it will be sent to the cloud server, which is then forwarded to the healthcare professionals, hospital database, and concerned patients. The proposed ETS-DNN model intends to facilitate timely data collection and processing to identify the patterns exist in the data. An extensive set of experimental analysis takes place and the results are investigated under several aspects. The simulation outcome pointed out the superior characteristics of the ETS-DNN model over the compared methods.","author":[{"family":"Pustokhina","given":"Irina Valeryevna"},{"family":"Pustokhin","given":"Denis Alexandrovich"},{"family":"Gupta","given":"Deepak"},{"family":"Khanna","given":"Ashish"},{"family":"Shankar","given":"K."},{"family":"Nguyen","given":"Gia Nhu"}],"citation-key":"pustokhinaEffectiveTrainingScheme2020","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2020.3000322","ISSN":"2169-3536","issued":{"date-parts":[[2020]]},"page":"107112-107123","source":"IEEE Xplore","title":"An Effective Training Scheme for Deep Neural Network in Edge Computing Enabled Internet of Medical Things (IoMT) Systems","type":"article-journal","volume":"8"},
  {"id":"Pyrimidine2022","abstract":"Pyrimidine () is an aromatic heterocyclic organic compound similar to pyridine. One of the three diazines (six-membered heterocyclics with two nitrogen atoms in the ring), it has the nitrogen atoms at positions 1 and 3 in the ring.: 250  The other diazines are pyrazine (nitrogen atoms at the 1 and 4 positions) and pyridazine (nitrogen atoms at the 1 and 2 positions). In nucleic acids, three types of nucleobases are pyrimidine derivatives: cytosine (C), thymine (T), and uracil (U).","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Pyrimidine2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,16]]},"language":"en","note":"Page Version ID: 1093358119","source":"Wikipedia","title":"Pyrimidine","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Pyrimidine&oldid=1093358119"},
  {"id":"qiaoEffectiveDataPrivacy2019","abstract":"With the rapid development of information science and the Internet of Things (IoT), people have an unprecedented ability to collect and share data, especially the various sensors as the entrance to data collection. At the same time, edge computing has begun to grasp the public's attention because of the difficult challenges of massive equipment access and massive data. Although such large amount of data provides a huge opportunity for information discovery, the privacy leakage has also been concerned. When the data publisher publishes various statistics, the attacker can obtain the statistical rules in the data by simply using the query function without contacting the user or the data publisher. Therefore, how to protect the data privacy of statistical information has become the focus of attention. In this paper, we proposed a partitioned histogram data publishing algorithm based on wavelet transform. Firstly, a partitioning algorithm based on greedy algorithm is used to obtain a better partition structure. Then, we use wavelet transform to add noise. Finally, for the authenticity and usability of histogram, we get the reductive original histogram structure. On the one hand, our algorithm can reduce the complexity of wavelet tree constructed by wavelet transform. On the other hand, the query noise changes from linear growth to multiple logarithm growth. So the accuracy of histogram counting query is improved. Experiments show that our algorithm has the significant improvement in data availability.","author":[{"family":"Qiao","given":"Yi"},{"family":"Liu","given":"Zhaobin"},{"family":"Lv","given":"Haoze"},{"family":"Li","given":"Minghui"},{"family":"Huang","given":"Zhiyi"},{"family":"Li","given":"Zhiyang"},{"family":"Liu","given":"Weijiang"}],"citation-key":"qiaoEffectiveDataPrivacy2019","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2019.2939015","ISSN":"2169-3536","issued":{"date-parts":[[2019]]},"page":"136203-136213","source":"IEEE Xplore","title":"An Effective Data Privacy Protection Algorithm Based on Differential Privacy in Edge Computing","type":"article-journal","volume":"7"},
  {"id":"Redox2022","abstract":"Redox (reduction–oxidation,  RED-oks,  REE-doks) is a type of chemical reaction in which the oxidation states of substrate change.\nOxidation is the loss of electrons or an increase in the oxidation state of a chemical or atoms within it.\nReduction is the gain of electrons or a decrease in the oxidation state of a chemical or atoms within it.There are two classes of redox reactions: \n\nelectron-transfer where only one (usually) electron flows from the reducing agent to the oxidant. This type of redox reaction is often discussed in term of redox couples and electrode potentials.\natom transfer, where an atom transfers from one substrate to another.  For example, in the rusting of iron, the oxidation state of iron atoms increases as it converts to an oxide and simultaneously the oxidation state of oxygen decreases as it accepts electrons released by iron.  Although oxidation reactions are commonly associated with the formation of oxides, other chemical species can serve the same function. In hydrogenation, C=C (and other) bonds are reduced by transfer of hydrogen atoms.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Redox2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,4]]},"language":"en","note":"Page Version ID: 1091527072","source":"Wikipedia","title":"Redox","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Redox&oldid=1091527072"},
  {"id":"songPredictingBloodGlucose2019","abstract":"Blood glucose monitoring is essential for diabetes management. Applying deep learning technique for blood glucose monitoring is promising, given its success in a range of healthcare and medical tasks. In this paper, we proposed a method that combines Empirical Mode Decomposition (EMD) with Long-Short Term Memory (LSTM) to achieve good experimental results in predicting patient blood glucose. We used patients' real blood glucose levels time series data to train the method proposed in this paper and to predict blood glucose for 30 minutes to 120 minutes. First, we use only blood glucose readings and timestamps in the dataset. Meanwhile, we used ADF to verify the non-stationarity of blood glucose time series. Then, we use EMD to decompose the blood glucose time series and use LSTM to train the decomposed time series to obtain a blood glucose prediction model. Finally, Mean Absolute Error (MAE) and root mean squared error (RMSE) were used to evaluate the experimental results. On the test dataset, the mean values of the MAE and RMSE are 0.4458mmol/L and 1.08mmol/L for 30mins, 0.87 and 1.27 mmol/L for 60mins, 0.85mmol/L and 1.36 mmol/L for 120mins, respectively. Experimental results show that the EMD+LSTM had better predictive performance than the LSTM when blood glucose changed dramatically. Meanwhile, it is still challenging to reach a high accuracy of predicting the long-term blood glucose.","author":[{"family":"Song","given":"Wei"},{"family":"Cai","given":"Wanyuan"},{"family":"Li","given":"Jing"},{"family":"Jiang","given":"Fusong"},{"family":"He","given":"Shengqi"}],"citation-key":"songPredictingBloodGlucose2019","container-title":"2019 6th International Conference on Systems and Informatics (ICSAI)","DOI":"10.1109/ICSAI48974.2019.9010318","event":"2019 6th International Conference on Systems and Informatics (ICSAI)","issued":{"date-parts":[[2019,11]]},"page":"1443-1448","source":"IEEE Xplore","title":"Predicting Blood Glucose Levels with EMD and LSTM Based CGM Data","type":"paper-conference"},
  {"id":"StorageProtein2020","abstract":"Storage proteins serve as biological reserves of metal ions and amino acids, used by organisms. They are found in plant seeds, egg whites, and milk.\nFerritin is an example of a storage protein that stores iron. Iron is a component of heme, which is contained in the transport protein, hemoglobin and in cytochromes.\nSome storage proteins store amino acids. Storage proteins' amino acids are used in embryonic development of animals or plants. Two amino acid storage proteins in animals are casein and ovalbumin.\nSeeds, particularly of leguminous plants, contain high concentrations of storage proteins. Up to 25 percent of the dry weight of the seed can be composed of storage proteins. The best known storage protein in wheat is the prolamin gliadin, a component of gluten.","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"StorageProtein2020","container-title":"Wikipedia","issued":{"date-parts":[[2020,10,20]]},"language":"en","note":"Page Version ID: 984468213","source":"Wikipedia","title":"Storage protein","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Storage_protein&oldid=984468213"},
  {"id":"StructuralBiochemistryEnzyme","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"StructuralBiochemistryEnzyme","language":"en","title":"Structural Biochemistry/Enzyme Catalytic Mechanism/Protein Function - Wikibooks, open books for an open world","type":"webpage","URL":"https://en.wikibooks.org/wiki/Structural_Biochemistry/Enzyme_Catalytic_Mechanism/Protein_Function"},
  {"id":"StructuralProteinFunction","abstract":"JoVE publishes peer-reviewed scientific video protocols to accelerate biological, medical, chemical and physical research. Watch our scientific video articles.","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"StructuralProteinFunction","language":"en","title":"Structural Protein Function: Collagen, Actin, Myosin and Keratin | Molecular Biology | JoVE","title-short":"Structural Protein Function","type":"webpage","URL":"https://www.jove.com/science-education/11524/structural-protein-function"},
  {"id":"Sucrose2022","abstract":"Sucrose, a disaccharide, is a sugar composed of glucose and fructose subunits. It is produced naturally in plants and is the main constituent of white sugar. It has the molecular formula C12H22O11.\nFor human consumption, sucrose is extracted and refined from either sugarcane or sugar beet. Sugar mills – typically located in tropical regions near where sugarcane is grown – crush the cane and produce raw sugar which is shipped to other factories for refining into pure sucrose. Sugar beet factories are located in temperate climates where the beet is grown, and process the beets directly into refined sugar. The sugar-refining process involves washing the raw sugar crystals before dissolving them into a sugar syrup which is filtered and then passed over carbon to remove any residual colour. The sugar syrup is then concentrated by boiling under a vacuum and crystallized as the final purification process to produce crystals of pure sucrose that are clear, odorless, and sweet.\nSugar is often an added ingredient in food production and recipes. About 185 million tonnes of sugar were produced worldwide in 2017.Sucrose is particularly dangerous from the point of view of tooth decay because Streptococcus mutans bacteria convert it into a sticky, extracellular, dextran-based polysaccharide that allows them to cohere, forming plaque. Sucrose is the only sugar that bacteria can use to form this sticky polysaccharide.","accessed":{"date-parts":[[2022,6,22]]},"citation-key":"Sucrose2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,11]]},"language":"en","note":"Page Version ID: 1092683883","source":"Wikipedia","title":"Sucrose","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Sucrose&oldid=1092683883"},
  {"id":"Vein2022","abstract":"Veins are blood vessels in humans, and most other animals that carry blood towards the heart. Most veins carry deoxygenated blood from the tissues back to the heart; exceptions are the pulmonary and umbilical veins, both of which carry oxygenated blood to the heart. In contrast to veins, arteries carry blood away from the heart.\nVeins are less muscular than arteries and are often closer to the skin. There are valves (called pocket valves) in most veins to prevent backflow.","accessed":{"date-parts":[[2022,6,20]]},"citation-key":"Vein2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,31]]},"language":"en","note":"Page Version ID: 1090764079","source":"Wikipedia","title":"Vein","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Vein&oldid=1090764079"},
  {"id":"voetFundamentalsBiochemistryLife2016","author":[{"family":"Voet","given":"Donald"},{"family":"Voet","given":"Judith G."},{"family":"Pratt","given":"Charlotte W."}],"call-number":"QD415 .V65 2016","citation-key":"voetFundamentalsBiochemistryLife2016","edition":"5th edition","event-place":"Hoboken, NJ","ISBN":"978-1-118-91840-1 978-1-118-91843-2","issued":{"date-parts":[[2016]]},"language":"en","number-of-pages":"1098","publisher":"John Wiley & Sons","publisher-place":"Hoboken, NJ","source":"Library of Congress ISBN","title":"Fundamentals of biochemistry: life at the molecular level","title-short":"Fundamentals of biochemistry","type":"book"},
  {"id":"wangBloodGlucosePrediction2020","abstract":"The time series of blood glucose concentration in diabetics are time-varying, nonlinear and non-stationary. To improve the accuracy of blood glucose prediction, a short-term blood glucose prediction model (VMD-IPSO-LSTM) combining variational modal decomposition (VDM) and improved Particle swarm optimization optimizing Long short-term memory network (IPSO-LSTM) was proposed. Firstly, the time series of blood glucose concentration of patients was decomposed by using VMD method to obtain the intrinsic modal functions (IMF) of blood glucose components in different frequency bands, so as to reduce the non-stationarity of blood glucose time series. Then a prediction model was established for each blood glucose component IMF by using the long and short time memory network. Since the number of neurons, learning rate and time window length of LSTM are difficult to determine, the improved PSO algorithm is used to optimize these parameters. The optimized LSTM network was used to predict each IMF, and finally the predicted subsequence was superimposed to obtain the final prediction result. The data of 56 patients were selected as experimental data from 451 patients with diabetes mellitus. The experimental results showed that the proposed VMD-IPSO-LSTM model could achieve high prediction accuracy at 30min, 45min and 60min in advance. When predicted 60 minutes in advance, compared with the LSTM, VMD-LSTM and VMD-PSO-LSTM methods, the RMSE of proposed method decreased by 15.565,3.402,1.215 and the MAPE of proposed method decreased by 11.284%,2.024%, 0.834%, and the percentage of predicted values falling into the A zone increased by 23.5%,6.1% and 2.8% in the Clarke error grid, respectively. The improved accuracy of blood glucose prediction and longer prediction time can provide sufficient time for physicians and patients to control blood glucose concentrations and improve the effectiveness of diabetes treatment.","author":[{"family":"Wang","given":"Wenbo"},{"family":"Tong","given":"Meng"},{"family":"Yu","given":"Min"}],"citation-key":"wangBloodGlucosePrediction2020","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2020.3041355","ISSN":"2169-3536","issued":{"date-parts":[[2020]]},"page":"217908-217916","source":"IEEE Xplore","title":"Blood Glucose Prediction With VMD and LSTM Optimized by Improved Particle Swarm Optimization","type":"article-journal","volume":"8"},
  {"id":"WhatAreDehydration","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"WhatAreDehydration","title":"What are dehydration of alcohol? Definition, Types and Importance - chemistry | AESL","type":"webpage","URL":"https://www.aakash.ac.in/important-concepts/chemistry/dehydration-of-alcohol"},
  {"id":"xieBenchmarkingMachineLearning2020","abstract":"Objective: \nThis paper aims to compare the performance of several commonly known machine-learning (ML) models versus a classic Autoregression with Exogenous inputs (ARX) model in the prediction of blood glucose (BG) levels using time-series data of patients with Type 1 diabetes (T1D).\n\nMethods:\nThe ML algorithms include ML-based regression models and deep learning models such as a vanilla Long-Short-Term-Memory (LSTM) Network and a Temporal Convolution Network (TCN). Evaluations have been conducted with respect to different input features, regression model orders, as well as using the recursive method or direct method for multi-step prediction of BG levels. Prediction performance metrics include the average Root Mean Square Error (RMSE), temporal gain (TG) for early prediction, and the normalized energy of the second-order differences (ESOD) of the predicted time series for reflecting risk of false alerts on hypo/hyper glycemia events.\n\nResults:\nThe ARX model achieved the lowest average RMSE for both recursive and direct methods, the second highest average TG under the direct method, but with a higher average normalized ESOD than some other models.\n\nConclusion:\nThere was no significant advantage observed from the ML models compared to the classic ARX model in predicting BG levels for T1D, except that TCN's performance was more robust with respect to BG trajectories with spurious oscillations, for which ARX tended to over-predict peak BG values and under-predict valley BG values.\n\nSignificance:\nInsight learned from this study could help researchers and clinical practitioners to select appropriate models for BG prediction.","author":[{"family":"Xie","given":"Jinyu"},{"family":"Wang","given":"Qian"}],"citation-key":"xieBenchmarkingMachineLearning2020","container-title":"IEEE Transactions on Biomedical Engineering","container-title-short":"IEEE Transactions on Biomedical Engineering","DOI":"10.1109/TBME.2020.2975959","issued":{"date-parts":[[2020,2,17]]},"source":"ResearchGate","title":"Benchmarking Machine Learning Algorithms on Blood Glucose Prediction for Type I Diabetes in Comparison With Classical Time-Series Models","type":"article-journal","volume":"PP"}
]
