[
  {"id":"14DehydrationReactions2016","abstract":"Alcohols can form alkenes via the E1 or E2 pathway depending on the structure of the alcohol and the reaction conditions.&nbsp; Markovnokov's Rule still applies and carbocation rearrangements must be …","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"14DehydrationReactions2016","container-title":"Chemistry LibreTexts","issued":{"date-parts":[[2016,2,9]]},"language":"en","title":"14.4: Dehydration Reactions of Alcohols","title-short":"14.4","type":"webpage","URL":"https://chem.libretexts.org/Bookshelves/Organic_Chemistry/Map%3A_Organic_Chemistry_(Wade)/14%3A_Reactions_of_Alcohols/14.04%3A_Dehydration_Reactions_of_Alcohols"},
  {"id":"AcetylCoA2022","abstract":"Acetyl-CoA (acetyl coenzyme A) is a molecule that participates in many biochemical reactions in protein, carbohydrate and lipid metabolism. Its main function is to deliver the acetyl group to the citric acid cycle (Krebs cycle) to be oxidized for energy production. Coenzyme A (CoASH or CoA) consists of a β-mercaptoethylamine group linked to the vitamin pantothenic acid (B5) through an amide linkage and 3'-phosphorylated ADP. The acetyl group (indicated in blue in the structural diagram on the right) of acetyl-CoA is linked to the sulfhydryl substituent of the β-mercaptoethylamine group. This thioester linkage is a \"high energy\" bond, which is particularly reactive. Hydrolysis of the thioester bond is exergonic (−31.5 kJ/mol).\nCoA is acetylated to acetyl-CoA by the breakdown of carbohydrates through glycolysis and by the breakdown of fatty acids through β-oxidation. Acetyl-CoA then enters the citric acid cycle, where the acetyl group is oxidized to carbon dioxide and water, and the energy released is captured in the form of 11 ATP and one GTP per acetyl group. GTP is the equivalent of ATP and they can be interconverted by Nucleoside-diphosphate kinase.Konrad Bloch and Feodor Lynen were awarded the 1964 Nobel Prize in Physiology and Medicine for their discoveries linking acetyl-CoA and fatty acid metabolism. Fritz Lipmann won the Nobel Prize in 1953 for his discovery of the cofactor coenzyme A.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"AcetylCoA2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,11]]},"language":"en","note":"Page Version ID: 1087344668","source":"Wikipedia","title":"Acetyl-CoA","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Acetyl-CoA&oldid=1087344668"},
  {"id":"AcetylCoACrossroads","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"AcetylCoACrossroads","title":"Acetyl CoA Crossroads","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/623acetylCoAfate.html"},
  {"id":"Acid2022","abstract":"An acid is a molecule or ion capable of either donating a proton (i.e. hydrogen ion, H+), known as a Brønsted–Lowry acid, or forming a covalent bond with an electron pair, known as a Lewis acid.The first category of acids are the proton donors, or Brønsted–Lowry acids. In the special case of aqueous solutions, proton donors form the hydronium ion H3O+ and are known as Arrhenius acids. Brønsted and Lowry generalized the Arrhenius theory to include non-aqueous solvents. A Brønsted or Arrhenius acid usually contains a hydrogen atom bonded to a chemical structure that is still energetically favorable after loss of H+.\nAqueous Arrhenius acids have characteristic properties that provide a practical description of an acid. Acids form aqueous solutions with a sour taste, can turn blue litmus red, and react with bases and certain metals (like calcium) to form salts. The word acid is derived from the Latin acidus/acēre, meaning 'sour'. An aqueous solution of an acid has a pH less than 7 and is colloquially also referred to as \"acid\" (as in \"dissolved in acid\"), while the strict definition refers only to the solute. A lower pH means a higher acidity, and thus a higher concentration of positive hydrogen ions in the solution. Chemicals or substances having the property of an acid are said to be acidic.\nCommon aqueous acids include hydrochloric acid (a solution of hydrogen chloride that is found in gastric acid in the stomach and activates digestive enzymes), acetic acid (vinegar is a dilute aqueous solution of this liquid), sulfuric acid (used in car batteries), and citric acid (found in citrus fruits). As these examples show, acids (in the colloquial sense) can be solutions or pure substances, and can be derived from acids (in the strict sense) that are solids, liquids, or gases. Strong acids and some concentrated weak acids are corrosive, but there are exceptions such as carboranes and boric acid.\nThe second category of acids are Lewis acids, which form a covalent bond with an electron pair. An example is boron trifluoride (BF3), whose boron atom has a vacant orbital that can form a covalent bond by sharing a lone pair of electrons on an atom in a base, for example the nitrogen atom in ammonia (NH3). Lewis considered this as a generalization of the Brønsted definition, so that an acid is a chemical species that accepts electron pairs either directly or by releasing protons (H+) into the solution, which then accept electron pairs. Hydrogen chloride, acetic acid, and most other Brønsted–Lowry acids cannot form a covalent bond with an electron pair, however, and are therefore not Lewis acids. Conversely, many Lewis acids are not Arrhenius or Brønsted–Lowry acids. In modern terminology, an acid is implicitly a Brønsted acid and not a Lewis acid, since chemists almost always refer to a Lewis acid explicitly as a Lewis acid.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Acid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,31]]},"language":"en","note":"Page Version ID: 1090817663","source":"Wikipedia","title":"Acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Acid&oldid=1090817663"},
  {"id":"AdenosineTriphosphateSynthesis","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"AdenosineTriphosphateSynthesis","title":"Adenosine Triphosphate Synthesis - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/adenosine-triphosphate-synthesis"},
  {"id":"Alkane2022","abstract":"In organic chemistry, an alkane, or paraffin (a historical trivial name that also has other meanings), is an acyclic saturated hydrocarbon. In other words, an alkane consists of hydrogen and carbon atoms arranged in a tree structure in which all the carbon–carbon bonds are single. Alkanes have the general chemical formula CnH2n+2. The alkanes range in complexity from the simplest case of methane (CH4), where n = 1 (sometimes called the parent molecule), to arbitrarily large and complex molecules, like pentacontane (C50H102) or 6-ethyl-2-methyl-5-(1-methylethyl) octane, an isomer of tetradecane (C14H30).\nThe International Union of Pure and Applied Chemistry (IUPAC) defines alkanes as \"acyclic branched or unbranched hydrocarbons having the general formula CnH2n+2, and therefore consisting entirely of hydrogen atoms and saturated carbon atoms\". However, some sources use the term to denote any saturated hydrocarbon, including those that are either monocyclic (i.e. the cycloalkanes) or polycyclic, despite their having a distinct general formula (i.e. cycloalkanes are CnH2n).\nIn an alkane, each carbon atom is sp3-hybridized with 4 sigma bonds (either C–C or C–H), and each hydrogen atom is joined to one of the carbon atoms (in a C–H bond). The longest series of linked carbon atoms in a molecule is known as its carbon skeleton or carbon backbone. The number of carbon atoms may be considered as the size of the alkane.\nOne group of the higher alkanes are waxes, solids at standard ambient temperature and pressure (SATP), for which the number of carbon atoms in the carbon backbone is greater than about 17.\nWith their repeated –CH2 units, the alkanes constitute a homologous series of organic compounds in which the members differ in molecular mass by multiples of 14.03 u (the total mass of each such methylene-bridge unit, which comprises a single carbon atom of mass 12.01 u and two hydrogen atoms of mass ~1.01 u each).\nMethane is produced by methanogenic bacteria and some long-chain alkanes function as pheromones in certain animal species or as protective waxes in plants and fungi. Nevertheless, most alkanes do not have much biological activity.  They can be viewed as molecular trees upon which can be hung the more active/reactive functional groups of biological molecules.\nThe alkanes have two main commercial sources: petroleum (crude oil) and natural gas.\nAn alkyl group is an alkane-based molecular fragment that bears one open valence for bonding. They are generally abbreviated with the symbol for any organyl group, R, although Alk is sometimes used to specifically symbolize an alkyl group (as opposed to an alkenyl group or aryl group).","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Alkane2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,3]]},"language":"en","note":"Page Version ID: 1091303832","source":"Wikipedia","title":"Alkane","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Alkane&oldid=1091303832"},
  {"id":"Alkyl2022","abstract":"In organic chemistry, an alkyl substituent is an alkane missing one hydrogen.\nThe term alkyl is intentionally unspecific to include many possible substitutions. \nAn acyclic alkyl has the general formula of CnH2n+1. A cycloalkyl is derived from a cycloalkane by removal of a hydrogen atom from a ring and has the general formula CnH2n-1.\nTypically an alkyl is a part of a larger molecule. In structural formulae, the symbol R is used to designate a generic (unspecified) alkyl group. The smallest alkyl group is methyl, with the formula CH−3.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Alkyl2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,13]]},"language":"en","note":"Page Version ID: 1087623015","source":"Wikipedia","title":"Alkyl","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Alkyl&oldid=1087623015"},
  {"id":"americandiabetesassociationDiagnosisClassificationDiabetes2014","accessed":{"date-parts":[[2022,6,4]]},"author":[{"literal":"American Diabetes Association"}],"citation-key":"americandiabetesassociationDiagnosisClassificationDiabetes2014","container-title":"Diabetes Care","DOI":"10.2337/dc14-S081","ISSN":"0149-5992, 1935-5548","issue":"Supplement_1","issued":{"date-parts":[[2014,1,1]]},"language":"en","page":"S81-S90","source":"DOI.org (Crossref)","title":"Diagnosis and Classification of Diabetes Mellitus","type":"article-journal","URL":"https://diabetesjournals.org/care/article/37/Supplement_1/S81/37753/Diagnosis-and-Classification-of-Diabetes-Mellitus","volume":"37"},
  {"id":"ATPSynthase2022","abstract":"ATP synthase is a protein that catalyzes the formation of the energy storage molecule adenosine triphosphate (ATP) using adenosine diphosphate (ADP) and inorganic phosphate (Pi). It is classified under ligases as it changes ADP by the formation of P-O bond (phosphodiester bond). ATP synthase is a molecular machine. The overall reaction catalyzed by ATP synthase is:\n\nADP + Pi + 2H+out ⇌ ATP + H2O + 2H+inThe formation of ATP from ADP and Pi is energetically unfavorable and would normally proceed in the reverse direction. In order to drive this reaction forward, ATP synthase couples ATP synthesis during cellular respiration to an electrochemical gradient created by the difference in proton (H+) concentration across the inner mitochondrial membrane in eukaryotes or the plasma membrane in bacteria. During photosynthesis in plants, ATP is synthesized by ATP synthase using a proton gradient created in the thylakoid lumen through the thylakoid membrane and into the chloroplast stroma.\nEukaryotic ATP synthases are F-ATPases, running \"in reverse\" for an ATPase. This article deals mainly with this type. An F-ATPase consists of two main subunits, FO and F1, which has a rotational motor mechanism allowing for ATP production.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"ATPSynthase2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,3,26]]},"language":"en","note":"Page Version ID: 1079393166","source":"Wikipedia","title":"ATP synthase","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=ATP_synthase&oldid=1079393166"},
  {"id":"bellazziBayesianAnalysisBlood2000","abstract":"This paper describes the application of a novel Bayesian estimation technique to extract the structural components, i.e., trend and daily patterns, from blood glucose level time series coming from home monitoring of insulin dependent diabetes mellitus patients. The problem is formulated through a set of stochastic equations, and is solved in a Bayesian framework by using a Markov chain Monte Carlo technique. The potential of the method is illustrated by analyzing data coming from the home monitoring of a 14-year old male patient.","author":[{"family":"Bellazzi","given":"Riccardo"},{"family":"Magni","given":"Paolo"},{"family":"Nicolao","given":"Giuseppe"}],"citation-key":"bellazziBayesianAnalysisBlood2000","container-title":"IEEE transactions on bio-medical engineering","container-title-short":"IEEE transactions on bio-medical engineering","DOI":"10.1109/10.846693","issued":{"date-parts":[[2000,8,1]]},"page":"971-5","source":"ResearchGate","title":"Bayesian analysis of blood glucose time series from diabetes home monitoring","type":"article-journal","volume":"47"},
  {"id":"bellazziIntelligentAnalysisClinical","accessed":{"date-parts":[[2022,4,27]]},"author":[{"family":"Bellazzi","given":"R."},{"family":"Larizza","given":"C."},{"family":"Magni","given":"P."},{"family":"Montani","given":"S."},{"family":"Stefanelli","given":"M."}],"citation-key":"bellazziIntelligentAnalysisClinical","DOI":"10.1016/S0933-3657(00)00052-X","language":"en","title":"Intelligent analysis of clinical time series: an application in the diabetes mellitus domain","title-short":"PII","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S093336570000052X?token=2F010F854209C6206D867A30AEB212BCDD1204F076C59CA1EF00E5144A93610552C7B0BE4D36417C1C2E3D8A1F905532&originRegion=eu-west-1&originCreation=20220427234616"},
  {"id":"benderCitricAcidCycle2016","abstract":"OBJECTIVESAfter studying this chapter, you should be able to:Describe the reactions of the citric acid cycle and the reactions that lead to the production of reducing equivalents that are oxidized in the mitochondrial electron transport chain to yield ATP. Explain the importance of vitamins in the citric acid cycle.Explain how the citric acid cycle provides both a route for catabolism of amino acids and also a route for their synthesis.Describe the main anaplerotic pathways that permit replenishment of citric acid cycle intermediates, and how the withdrawal of oxaloacetate for gluconeogenesis is controlled.Describe the role of the citric acid cycle in fatty acid synthesis.Explain how the activity of the citric acid cycle is controlled by the availability of oxidized cofactors.Explain how hyperammonemia can lead to loss of consciousness.","accessed":{"date-parts":[[2022,6,5]]},"author":[{"family":"Bender","given":"David A."},{"family":"Mayes","given":"Peter A."}],"citation-key":"benderCitricAcidCycle2016","container-title":"Harper's Illustrated Biochemistry","edition":"30","editor":[{"family":"Rodwell","given":"Victor W."},{"family":"Bender","given":"David A."},{"family":"Botham","given":"Kathleen M."},{"family":"Kennelly","given":"Peter J."},{"family":"Weil","given":"P. Anthony"}],"event-place":"New York, NY","issued":{"date-parts":[[2016]]},"publisher":"McGraw-Hill Education","publisher-place":"New York, NY","source":"Access Medicine","title":"The Citric Acid Cycle: The Central Pathway of Carbohydrate, Lipid & Amino Acid Metabolism","title-short":"The Citric Acid Cycle","type":"chapter","URL":"https://accessmedicine.mhmedical.com/Content.aspx?bookId=1366&sectionId=73243571#1106056878"},
  {"id":"bewickchemistryAlcoholDehydrationMechanism2020","abstract":"Elimination / dehydration reaction mechanism for secondary and primary alcohols with a sulfuric acid catalyst","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"bewickchemistryAlcoholDehydrationMechanism2020","dimensions":"9:49","director":[{"literal":"Bewickchemistry"}],"issued":{"date-parts":[[2020,3,26]]},"source":"YouTube","title":"Alcohol Dehydration Mechanism","type":"motion_picture","URL":"https://www.youtube.com/watch?v=eChpMza8it4"},
  {"id":"CarbohydratesGlucose","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"CarbohydratesGlucose","title":"Carbohydrates - Glucose","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/543glucose.html"},
  {"id":"CarbohydratesGlycogen","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"CarbohydratesGlycogen","title":"Carbohydrates - Glycogen","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/547glycogen.html"},
  {"id":"CH105ChapterAlkenes","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"CH105ChapterAlkenes","language":"en-US","title":"CH105: Chapter 8 – Alkenes, Alkynes and Aromatic Compounds – Chemistry","title-short":"CH105","type":"post-weblog","URL":"https://wou.edu/chemistry/courses/online-chemistry-textbooks/ch105-consumer-chemistry/ch105-chapter-8/"},
  {"id":"ChemicalSynthesis2022","abstract":"As a topic of chemistry, chemical synthesis (or combination) is the artificial execution of chemical reactions to obtain one or several products. This occurs by physical and chemical manipulations usually involving one or more reactions. In modern laboratory uses, the process is reproducible and reliable.\nA chemical synthesis involves one or more compounds (known as reagents or reactants) that will experience a transformation when subjected to certain conditions. Various reaction types can be applied to formulate a desired product. This requires mixing the compounds in a reaction vessel, such as a chemical reactor or a simple round-bottom flask. Many reactions require some form of processing (\"work-up\") or purification procedure to isolate the final product.The amount produced by chemical synthesis is known as the reaction yield. Typically, yields are expressed as a mass in grams (in a laboratory setting) or as a percentage of the total theoretical quantity that could be produced based on the limiting reagent. A side reaction is an unwanted chemical reaction occurring which reduces the desired yield. The word synthesis was used first in a chemical context by the chemist Hermann Kolbe.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"ChemicalSynthesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,8]]},"language":"en","note":"Page Version ID: 1086756094","source":"Wikipedia","title":"Chemical synthesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Chemical_synthesis&oldid=1086756094"},
  {"id":"CitricAcidCycle2022","abstract":"The citric acid cycle (CAC)—also known as the Krebs cycle or the TCA cycle (tricarboxylic acid cycle)—is a series of chemical reactions to release stored energy through the oxidation of acetyl-CoA derived from carbohydrates, fats, and proteins. The Krebs cycle is used by organisms that respire (as opposed to organisms that ferment) to generate energy, either by anaerobic respiration or aerobic respiration. In addition, the cycle provides precursors of certain amino acids, as well as the reducing agent NADH, that are used in numerous other reactions. Its central importance to many biochemical pathways suggests that it was one of the earliest components of metabolism and may have originated abiogenically. Even though it is branded as a 'cycle', it is not necessary for metabolites to follow only one specific route; at least three alternative segments of the citric acid cycle have been recognized.The name of this metabolic pathway is derived from the citric acid (a tricarboxylic acid, often called citrate, as the ionized form predominates at biological pH) that is consumed and then regenerated by this sequence of reactions to complete the cycle. The cycle consumes acetate (in the form of acetyl-CoA) and water, reduces NAD+ to NADH, releasing carbon dioxide. The NADH generated by the citric acid cycle is fed into the oxidative phosphorylation (electron transport) pathway. The net result of these two closely linked pathways is the oxidation of nutrients to produce usable chemical energy in the form of ATP.\nIn eukaryotic cells, the citric acid cycle occurs in the matrix of the mitochondrion. In prokaryotic cells, such as bacteria, which lack mitochondria, the citric acid cycle reaction sequence is performed in the cytosol with the proton gradient for ATP production being across the cell's surface (plasma membrane) rather than the inner membrane of the mitochondrion. The overall yield of energy-containing compounds from the citric acid cycle is three NADH, one FADH2, and one GTP.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"CitricAcidCycle2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,3]]},"language":"en","note":"Page Version ID: 1091355465","source":"Wikipedia","title":"Citric acid cycle","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Citric_acid_cycle&oldid=1091355465"},
  {"id":"clarkBiology2020","abstract":"Biology 2e (2nd edition) is designed to cover the scope and sequence requirements of a typical two-semester biology course for science majors. The text provides comprehensive coverage of foundational research and core biology concepts through an evolutionary lens. Biology includes rich features that engage students in scientific inquiry, highlight careers in the biological sciences, and offer everyday applications. The book also includes various types of practice and homework questions that help students understand -- and apply -- key concepts. The 2nd edition has been revised to incorporate clearer, more current, and more dynamic explanations, while maintaining the same organization as the first edition. Art and illustrations have been substantially improved, and the textbook features additional assessments and related resources.","author":[{"family":"Clark","given":"Mary Ann"},{"family":"Choi","given":"Jung Ho"},{"family":"Douglas","given":"Matthew M"},{"literal":"OpenStax (Nonprofit organization)"}],"citation-key":"clarkBiology2020","ISBN":"978-1-947172-51-7 978-1-947172-95-1 978-1-5066-9985-1","issued":{"date-parts":[[2020]]},"language":"English","note":"OCLC: 1233239446","source":"Open WorldCat","title":"Biology","type":"book"},
  {"id":"ContractileProteinsLatest","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ContractileProteinsLatest","title":"Contractile proteins - Latest research and news | Nature","type":"webpage","URL":"https://www.nature.com/subjects/contractile-proteins"},
  {"id":"dantoniPredictionGlucoseConcentration2022","abstract":"Background: Type 1 Diabetes Mellitus (T1D) is an autoimmune disease that can cause serious complications that can be avoided by preventing the glycemic levels from exceeding the physiological range. Straightforwardly, many data-driven models were developed to forecast future glycemic levels and to allow patients to avoid adverse events. Most models are tuned on data of adult patients, whereas the prediction of glycemic levels of pediatric patients has been rarely investigated, as they represent the most challenging T1D population. Methods: A Convolutional Neural Network (CNN) and a Long Short-Term Memory (LSTM) Recurrent Neural Network were optimized on glucose, insulin, and meal data of 10 virtual pediatric patients. The trained models were then implemented on two edge-computing boards to evaluate the feasibility of an edge system for glucose forecasting in terms of prediction accuracy and inference time. Results: The LSTM model achieved the best numeric and clinical accuracy when tested in the .tflite format, whereas the CNN achieved the best clinical accuracy in uint8. The inference time for each prediction was far under the limit represented by the sampling period. Conclusion: Both models effectively predict glucose in pediatric patients in terms of numerical and clinical accuracy. The edge implementation did not show a significant performance decrease, and the inference time was largely adequate for a real-time application.","accessed":{"date-parts":[[2022,4,27]]},"author":[{"family":"D’Antoni","given":"Federico"},{"family":"Petrosino","given":"Lorenzo"},{"family":"Sgarro","given":"Fabiola"},{"family":"Pagano","given":"Antonio"},{"family":"Vollero","given":"Luca"},{"family":"Piemonte","given":"Vincenzo"},{"family":"Merone","given":"Mario"}],"citation-key":"dantoniPredictionGlucoseConcentration2022","container-title":"Bioengineering","DOI":"10.3390/bioengineering9050183","ISSN":"2306-5354","issue":"5","issued":{"date-parts":[[2022,5]]},"language":"en","number":"5","page":"183","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"Prediction of Glucose Concentration in Children with Type 1 Diabetes Using Neural Networks: An Edge Computing Application","title-short":"Prediction of Glucose Concentration in Children with Type 1 Diabetes Using Neural Networks","type":"article-journal","URL":"https://www.mdpi.com/2306-5354/9/5/183","volume":"9"},
  {"id":"DatadrivenModelingPrediction","accessed":{"date-parts":[[2022,4,28]]},"citation-key":"DatadrivenModelingPrediction","DOI":"10.1016/j.artmed.2019.07.007","language":"en","title":"Data-driven modeling and prediction of blood glucose dynamics_ Machine learning applications in type 1 diabetes | Elsevier Enhanced Reader","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S0933365717306218?token=20D73867F133A3E0343AEF5FCFAD5EBBBDF7FD94E6EF156E29BC836D894F37633B1F34F1B933816860A41CA480C7E8E6&originRegion=eu-west-1&originCreation=20220428001325"},
  {"id":"DefinitionChronicDisease2011","abstract":"NCI's Dictionary of Cancer Terms provides easy-to-understand definitions for words and phrases related to cancer and medicine.","accessed":{"date-parts":[[2022,6,4]]},"archive_location":"nciglobal,ncienterprise","citation-key":"DefinitionChronicDisease2011","genre":"nciAppModulePage","issued":{"literal":"02/02/2011 - 07:00"},"language":"en","title":"Definition of chronic disease - NCI Dictionary of Cancer Terms - NCI","type":"webpage","URL":"https://www.cancer.gov/publications/dictionaries/cancer-terms/def/chronic-disease"},
  {"id":"deutschComputerSystemInterpreting","accessed":{"date-parts":[[2022,4,28]]},"author":[{"family":"Deutsch","given":"T."},{"family":"Gergely","given":"T."},{"family":"Trunov","given":"V."}],"citation-key":"deutschComputerSystemInterpreting","DOI":"10.1016/j.cmpb.2004.02.008","language":"en","title":"A computer system for interpreting blood glucose data","title-short":"doi","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S0169260704000665?token=EDA90F97B6086B589E888AC4A1AD8E91B110585A4DF394BB52124B40EC1F992B80766181EBD90042D57BF1B31A6866F4&originRegion=eu-west-1&originCreation=20220428000242"},
  {"id":"DiagnosticUltrasoundClinicalKey","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"DiagnosticUltrasoundClinicalKey","title":"Diagnostic Ultrasound - ClinicalKey","type":"webpage","URL":"https://www.clinicalkey.com/#!/browse/book/3-s2.0-C20141042251"},
  {"id":"Doi101016","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Doi101016","DOI":"10.1016/j.biocel.2003.08.010","language":"en","title":"doi:10.1016/j.biocel.2003.08.010 | Elsevier Enhanced Reader","title-short":"doi","type":"webpage","URL":"https://reader.elsevier.com/reader/sd/pii/S1357272503002917?token=875FC09A355F4783DE7F91EE681CBDB01BEFF89C6F0FC8DCA49859BC725BA617AD6F1E49D354434BEC6FFBBF2993AA5F&originRegion=eu-west-1&originCreation=20220605124441"},
  {"id":"Ester2022","abstract":"An ester is a chemical compound derived from an acid (organic or inorganic) in which at least one –OH hydroxyl group is replaced by an –O– alkyl (alkoxy) group, as in the substitution reaction of a carboxylic acid and an alcohol. Glycerides are fatty acid esters of glycerol; they are important in biology, being one of the main classes of lipids and comprising the bulk of animal fats and vegetable oils.\nEsters typically have a pleasant smell; those of low molecular weight are commonly used as fragrances and are found in essential oils and pheromones. They perform as high-grade solvents for a broad array of plastics, plasticizers, resins, and lacquers, and are one of the largest classes of synthetic lubricants on the commercial market. Polyesters are important plastics, with monomers linked by ester moieties. Phosphoesters form the backbone of DNA molecules. Nitrate esters, such as nitroglycerin, are known for their explosive properties.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Ester2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,2]]},"language":"en","note":"Page Version ID: 1091143519","source":"Wikipedia","title":"Ester","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ester&oldid=1091143519"},
  {"id":"EsterOverviewScienceDirect","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"EsterOverviewScienceDirect","title":"Ester - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/chemistry/ester"},
  {"id":"fowlerConceptsBiology","author":[{"family":"Fowler","given":"Samantha"},{"family":"Roush","given":"Rebecca"},{"family":"Wise","given":"James"}],"citation-key":"fowlerConceptsBiology","ISSN":"1-938168-11-9","language":"en","page":"621","source":"Zotero","title":"Concepts of Biology","type":"article-journal"},
  {"id":"FunctionsProteins","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"FunctionsProteins","title":"Functions of Proteins","type":"webpage","URL":"https://sphweb.bumc.bu.edu/otlt/mph-modules/ph/ph709_basiccellbiology/ph709_basiccellbiology7.html"},
  {"id":"gillespieType1Diabetes2016","accessed":{"date-parts":[[2022,4,28]]},"citation-key":"gillespieType1Diabetes2016","collection-title":"Methods in Molecular Biology","DOI":"10.1007/978-1-4939-3643-4","editor":[{"family":"Gillespie","given":"Kathleen M."}],"event-place":"New York, NY","ISBN":"978-1-4939-3641-0 978-1-4939-3643-4","issued":{"date-parts":[[2016]]},"language":"en","publisher":"Springer New York","publisher-place":"New York, NY","source":"DOI.org (Crossref)","title":"Type-1 Diabetes","type":"book","URL":"http://link.springer.com/10.1007/978-1-4939-3643-4","volume":"1433"},
  {"id":"GlucogenicAminoAcid2022","abstract":"A glucogenic amino acid (or glucoplastic amino acid) is an amino acid that can be converted into glucose through gluconeogenesis. This is in contrast to the ketogenic amino acids, which are converted into ketone bodies.\nThe production of glucose from glucogenic amino acids involves these amino acids being converted to alpha keto acids and then to glucose, with both processes occurring in the liver. This mechanism predominates during catabolysis, rising as fasting and starvation increase in severity.\nIn humans, the glucogenic amino acids are:\n\nAlanine\nArginine\nAsparagine\nAspartic acid\nCysteine\nGlutamic acid\nGlutamine\nGlycine\nHistidine\nMethionine\nProline\nSerine\nValineAmino acids that are both glucogenic and ketogenic (mnemonic \"PITTT\"):\n\nPhenylalanine\nIsoleucine\nThreonine\nTryptophan\nTyrosineOnly leucine and lysine are not glucogenic (they are only ketogenic).","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"GlucogenicAminoAcid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,2,18]]},"language":"en","note":"Page Version ID: 1072536547","source":"Wikipedia","title":"Glucogenic amino acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Glucogenic_amino_acid&oldid=1072536547"},
  {"id":"GlucogenicKetogenicAmino","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"GlucogenicKetogenicAmino","container-title":"Khan Academy","language":"en","title":"Glucogenic and ketogenic amino acids (practice)","type":"webpage","URL":"https://www.khanacademy.org/test-prep/mcat/biological-sciences-practice/biological-sciences-practice-tut/e/krebs-cycle-and-oxidative-phosphorylation---passage-2"},
  {"id":"Glucokinase2022","abstract":"Glucokinase (EC 2.7.1.2) is an enzyme that facilitates phosphorylation of glucose to glucose-6-phosphate. Glucokinase occurs in cells in the liver and pancreas of humans and most other vertebrates. In each of these organs it plays an important role in the regulation of carbohydrate metabolism by acting as a glucose sensor, triggering shifts in metabolism or cell function in response to rising or falling levels of glucose, such as occur after a meal or when fasting. Mutations of the gene for this enzyme can cause unusual forms of diabetes or hypoglycemia.\nGlucokinase (GK) is a hexokinase isozyme, related homologously to at least three other hexokinases. All of the hexokinases can mediate phosphorylation of glucose to glucose-6-phosphate (G6P), which is the first step of both glycogen synthesis and glycolysis. However, glucokinase is coded by a separate gene and its distinctive kinetic properties allow it to serve a different set of functions. Glucokinase has a lower affinity for glucose than the other hexokinases do, and its activity is localized to a few cell types, leaving the other three hexokinases as more important preparers of glucose for glycolysis and glycogen synthesis for most tissues and organs. Because of this reduced affinity, the activity of glucokinase, under usual physiological conditions, varies substantially according to the concentration of glucose.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Glucokinase2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,3]]},"language":"en","note":"Page Version ID: 1091370554","source":"Wikipedia","title":"Glucokinase","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Glucokinase&oldid=1091370554"},
  {"id":"Glycogenesis2022","abstract":"Glycogenesis is the process of glycogen synthesis, in which glucose molecules are added to chains of glycogen for storage. This process is activated during rest periods following the Cori cycle, in the liver, and also activated by insulin in response to high glucose levels.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Glycogenesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,3,3]]},"language":"en","note":"Page Version ID: 1075000146","source":"Wikipedia","title":"Glycogenesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Glycogenesis&oldid=1075000146"},
  {"id":"Glycogenesisa","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Glycogenesisa","title":"Glycogenesis","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/604glycogenesis.html"},
  {"id":"GlycogenesisGlycogenolysisGluconeogenesis","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"GlycogenesisGlycogenolysisGluconeogenesis","title":"Glycogenesis, Glycogenolysis, and Gluconeogenesis","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/604glycogenesis.html"},
  {"id":"GlycolysisGluconeogenesisHomo","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"GlycolysisGluconeogenesisHomo","title":"Glycolysis and gluconeogenesis (Homo sapiens) - WikiPathways","type":"webpage","URL":"https://www.wikipathways.org/index.php/Pathway:WP534"},
  {"id":"GlycolysisReactions","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"GlycolysisReactions","title":"Glycolysis Reactions","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/601glycolysisrx.html"},
  {"id":"GlycolysisSummary","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"GlycolysisSummary","title":"Glycolysis Summary","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/601glycolysissum.html"},
  {"id":"Hydrolysis2022","abstract":"Hydrolysis (; from Ancient Greek  hydro- 'water', and  lysis 'to unbind') is any chemical reaction in which a molecule of water breaks one or more chemical bonds. The term is used broadly for substitution, elimination, and solvation reactions in which water is the nucleophile.Biological hydrolysis is the cleavage of biomolecules where a water molecule is consumed to effect the separation of a larger molecule into component parts. When a carbohydrate is broken into its component sugar molecules by hydrolysis (e.g., sucrose being broken down into glucose and fructose), this is recognized as saccharification.Hydrolysis reactions can be the reverse of a condensation reaction in which two molecules join into a larger one and eject a water molecule. Thus hydrolysis adds water to break down, whereas condensation builds up by removing water.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Hydrolysis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,4,27]]},"language":"en","note":"Page Version ID: 1084951022","source":"Wikipedia","title":"Hydrolysis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Hydrolysis&oldid=1084951022"},
  {"id":"HydroxyGroup2022","abstract":"A hydroxy or hydroxyl group is a functional group with the chemical formula -OH and composed of one oxygen atom covalently bonded to one hydrogen atom. In organic chemistry, alcohols and carboxylic acids contain one or more hydroxy groups. Both the negatively charged anion HO−, called hydroxide, and the neutral radical HO•, known as the hydroxyl radical, consist of an unbonded hydroxyl group.\nAccording to IUPAC definitions, the term hydroxyl refers to the hydroxyl radical (·OH) only, while the functional group −OH is called hydroxy group.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"HydroxyGroup2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,26]]},"language":"en","note":"Page Version ID: 1089987791","source":"Wikipedia","title":"Hydroxy group","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Hydroxy_group&oldid=1089987791"},
  {"id":"InheritedMetabolicDisorders2021","abstract":"The field of inherited disorders of the nervous system has undergone major revolutions in the past 150 years. The 19th century saw the first systemic approach to disease through the use of rational, consistent outlines for taking histories and doing physical examinations.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"InheritedMetabolicDisorders2021","issued":{"literal":"2021-11-24-12:53"},"note":"Publication: Medscape - eMedicine","source":"eMedicine","title":"Inherited Metabolic Disorders: Overview, Clinical Features and Differential Diagnosis, Epidemiology and Statistics","title-short":"Inherited Metabolic Disorders","type":"article-journal","URL":"https://emedicine.medscape.com/article/1183253-overview?reg=1"},
  {"id":"Isomer2022","abstract":"In chemistry, isomers are molecules or polyatomic ions with identical molecular formulae – that is, same number of atoms of each element – but distinct arrangements of atoms in space. Isomerism is existence or possibility of isomers.\nIsomers do not necessarily share similar chemical or physical properties. Two main forms of isomerism are structural or constitutional isomerism, in which bonds between the atoms differ; and stereoisomerism or spatial isomerism, in which the bonds are the same but the relative positions of the atoms differ.\nIsomeric relationships form a hierarchy. Two chemicals might be the same constitutional isomer, but upon deeper analysis be stereoisomers of each other. Two molecules that are the same stereoisomer as each other might be in different conformational forms or be different isotopologues. The depth of analysis depends on the field of study or the chemical and physical properties of interest.\nThe English word \"isomer\" () is a back-formation from \"isomeric\", which was borrowed through German isomerisch from Swedish isomerisk; which in turn was coined from Greek ἰσόμερoς  isómeros, with roots isos = \"equal\",  méros = \"part\".","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Isomer2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,30]]},"language":"en","note":"Page Version ID: 1090688309","source":"Wikipedia","title":"Isomer","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Isomer&oldid=1090688309"},
  {"id":"Isomerization2022","abstract":"In chemistry isomerization or isomerisation is the process in which a molecule, ion or molecular fragment is transformed into an isomer with a different chemical structure. Enolization is an example of isomerization, as is tautomerization. When the isomerization occurs intramolecularly it may be called a rearrangement reaction.When the activation energy for the isomerization reaction is sufficiently small, both isomers will exist in a temperature-dependent equilibrium with each other. Many values of the standard free energy difference, \n  \n    \n      \n        Δ\n        \n          G\n          \n            ∘\n          \n        \n      \n    \n    {\\displaystyle \\Delta G^{\\circ }}\n  , have been calculated, with good agreement between observed and calculated data.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Isomerization2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,28]]},"language":"en","note":"Page Version ID: 1090334180","source":"Wikipedia","title":"Isomerization","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Isomerization&oldid=1090334180"},
  {"id":"klonoffFogComputingEdge2017","abstract":"The Internet of Things (IoT) is generating an immense volume of data. With cloud computing, medical sensor and actuator data can be stored and analyzed remotely by distributed servers. The results can then be delivered via the Internet. The number of devices in IoT includes such wireless diabetes devices as blood glucose monitors, continuous glucose monitors, insulin pens, insulin pumps, and closed-loop systems. The cloud model for data storage and analysis is increasingly unable to process the data avalanche, and processing is being pushed out to the edge of the network closer to where the data-generating devices are. Fog computing and edge computing are two architectures for data handling that can offload data from the cloud, process it nearby the patient, and transmit information machine-to-machine or machine-to-human in milliseconds or seconds. Sensor data can be processed near the sensing and actuating devices with fog computing (with local nodes) and with edge computing (within the sensing devices). Compared to cloud computing, fog computing and edge computing offer five advantages: (1) greater data transmission speed, (2) less dependence on limited bandwidths, (3) greater privacy and security, (4) greater control over data generated in foreign countries where laws may limit use or permit unwanted governmental access, and (5) lower costs because more sensor-derived data are used locally and less data are transmitted remotely. Connected diabetes devices almost all use fog computing or edge computing because diabetes patients require a very rapid response to sensor input and cannot tolerate delays for cloud computing.","accessed":{"date-parts":[[2022,4,28]]},"author":[{"family":"Klonoff","given":"David C."}],"citation-key":"klonoffFogComputingEdge2017","container-title":"Journal of Diabetes Science and Technology","container-title-short":"J Diabetes Sci Technol","DOI":"10.1177/1932296817717007","ISSN":"1932-2968","issue":"4","issued":{"date-parts":[[2017,7,1]]},"page":"647-652","publisher":"SAGE Publications Inc","source":"SAGE Journals","title":"Fog Computing and Edge Computing Architectures for Processing Data From Diabetes Devices Connected to the Medical Internet of Things","type":"article-journal","URL":"https://doi.org/10.1177/1932296817717007","volume":"11"},
  {"id":"kulkarniIsletVcell2004","abstract":"The ␤-cell is one of four major types of cells present in the islets of Langerhans, which are islands of cells distributed throughout the endocrine pancreas in most mammals. The ␤-cell synthesizes and secretes the hormone insulin mainly in response to glucose but also in response to several nutrients, hormones and nervous stimuli. In adult rodents the ␤-cell has a slow mitotic rate. Recent studies provide novel insights into the functions of the ␤-cell. The presence of functional insulin-like growth factor-1 and insulin receptors and components of their signaling pathway indicate an important role for insulin/IGF-1 signaling in the regulation of ␤-cell function. Further, the recent discovery of glucokinase (GK) and the ATP-dependent potassium channels on insulin secretory granules, the detection of AMP-protein kinase in the ␤-cell and the identiﬁcation of a new ␤-cell transcription factor, mMafA, are some exciting new areas of research currently underway to further understand the complex pathways that regulate the functions of ␤-cells.","accessed":{"date-parts":[[2022,6,5]]},"author":[{"family":"Kulkarni","given":"Rohit N"}],"citation-key":"kulkarniIsletVcell2004","container-title":"The International Journal of Biochemistry & Cell Biology","container-title-short":"The International Journal of Biochemistry & Cell Biology","DOI":"10.1016/j.biocel.2003.08.010","ISSN":"13572725","issue":"3","issued":{"date-parts":[[2004,3]]},"language":"en","page":"365-371","source":"DOI.org (Crossref)","title":"The islet β-cell","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1357272503002917","volume":"36"},
  {"id":"langChapterSixPediatric2014","abstract":"Hypoglycemia in the pediatric population is a common finding important to recognize and manage to prevent brain injury. Recent advances in molecular genetics have provided new insight into its biochemical and physiologic basis and have led to more appropriate and specific treatment. Although a major cause of brain injury in pediatrics, the ability to predict the long-term outcome in these patients remains difficult. Identification of these at-risk individuals is important. The physiologic adaptations associated with transition from fetal to neonatal life are now better understood thus allowing for improved surveillance and management. Despite these advances, analytical limitations of point-of-care testing instruments at low glucose concentration continue to persist. This review aims to address these questions and provide an overview of pediatric hypoglycemia and the molecular pathways involved.","accessed":{"date-parts":[[2022,6,5]]},"author":[{"family":"Lang","given":"Timothy F."},{"family":"Hussain","given":"Khalid"}],"citation-key":"langChapterSixPediatric2014","container-title":"Advances in Clinical Chemistry","DOI":"10.1016/B978-0-12-800094-6.00006-6","editor":[{"family":"Makowski","given":"Gregory S."}],"issued":{"date-parts":[[2014,1,1]]},"language":"en","page":"211-245","publisher":"Elsevier","source":"ScienceDirect","title":"Chapter Six - Pediatric Hypoglycemia","type":"chapter","URL":"https://www.sciencedirect.com/science/article/pii/B9780128000946000066","volume":"63"},
  {"id":"levyTypeDiabetes2016","author":[{"family":"Levy","given":"David"}],"call-number":"RC660 .L48 2016","citation-key":"levyTypeDiabetes2016","collection-title":"Oxford diabetes library","edition":"Second edition","event-place":"Oxford, United Kingdom ; New York, NY, USA","ISBN":"978-0-19-876645-2","issued":{"date-parts":[[2016]]},"language":"en","note":"OCLC: ocn957691494","number-of-pages":"248","publisher":"Oxford University Press","publisher-place":"Oxford, United Kingdom ; New York, NY, USA","source":"Library of Congress ISBN","title":"Type 1 diabetes","type":"book"},
  {"id":"liebenTypeDiabetesMellitus2017","abstract":"Type 1 diabetes mellitus (T1DM) is a chronic disease characterized by insulin deficiency as a consequence of pancreatic β-cell loss. This PrimeView highlights the mechanisms underlying T1DM, including immunemediated pancreatic β-cell loss.","accessed":{"date-parts":[[2022,6,3]]},"author":[{"family":"Lieben","given":"Lisbet"}],"citation-key":"liebenTypeDiabetesMellitus2017","container-title":"Nature Reviews Disease Primers","container-title-short":"Nat Rev Dis Primers","DOI":"10.1038/nrdp.2017.17","ISSN":"2056-676X","issue":"1","issued":{"date-parts":[[2017,12]]},"language":"en","page":"17017","source":"DOI.org (Crossref)","title":"Type 1 diabetes mellitus","type":"article-journal","URL":"http://www.nature.com/articles/nrdp201717","volume":"3"},
  {"id":"MainTypesAlcohol2020","abstract":"Chemistry, as a field, acknowledges three main types of alcohol: isopropyl, methyl, and ethyl alcohol. Each of these types of alcohol has different properties. Alcohols are those organic compounds. The presence of one, two or more hydroxyl groups (−OH) are the main characteristic of these compound.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"MainTypesAlcohol2020","container-title":"Toppr-guides","issued":{"date-parts":[[2020,3,2]]},"language":"en-US","section":"Solutions","title":"Main Types of Alcohol, Primary, Secondary and Tertiary Alcohols","type":"post-weblog","URL":"https://www.toppr.com/guides/chemistry/solutions/main-types-of-alcohol/"},
  {"id":"MedicalDictionaryHealth2011","abstract":"Online medical dictionary of health terms: J-P....","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MedicalDictionaryHealth2011","container-title":"Harvard Health","issued":{"date-parts":[[2011,12,13]]},"language":"en","title":"Medical Dictionary of Health Terms: J-P","title-short":"Medical Dictionary of Health Terms","type":"webpage","URL":"https://www.health.harvard.edu/j-through-p"},
  {"id":"MedicalDictionaryHealth2011a","abstract":"Online medical dictionary of health terms: A-C....","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MedicalDictionaryHealth2011a","container-title":"Harvard Health","issued":{"date-parts":[[2011,12,13]]},"language":"en","title":"Medical Dictionary of Health Terms: A-C","title-short":"Medical Dictionary of Health Terms","type":"webpage","URL":"https://www.health.harvard.edu/a-through-c"},
  {"id":"meisenbergPrinciplesMedicalBiochemistry","author":[{"family":"Meisenberg","given":"Gerhard"},{"family":"Simmons","given":"William H"}],"citation-key":"meisenbergPrinciplesMedicalBiochemistry","language":"en","page":"635","source":"Zotero","title":"Principles of Medical Biochemistry","type":"article-journal"},
  {"id":"meisenbergPrinciplesMedicalBiochemistrya","author":[{"family":"Meisenberg","given":"Gerhard"},{"family":"Simmons","given":"William H"}],"citation-key":"meisenbergPrinciplesMedicalBiochemistrya","language":"en","page":"635","source":"Zotero","title":"Principles of Medical Biochemistry","type":"article-journal"},
  {"id":"MetabolicDisorders","abstract":"Your metabolism makes energy from the food you eat. A metabolic disorder disrupts this process. One example is diabetes. Learn more.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MetabolicDisorders","genre":"Text","language":"eng","publisher":"National Library of Medicine","title":"Metabolic Disorders","type":"webpage","URL":"https://medlineplus.gov/metabolicdisorders.html"},
  {"id":"MetabolicSyndrome2017","abstract":"Find out what metabolic syndrome is, what the symptoms and risk factors are, and what you can do to reverse or prevent it.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MetabolicSyndrome2017","container-title":"nhs.uk","issued":{"literal":"19 Oct 2017, 12:49 p.m."},"language":"en","section":"conditions","title":"Metabolic syndrome","type":"webpage","URL":"https://www.nhs.uk/conditions/metabolic-syndrome/"},
  {"id":"MetabolicSyndromeSymptoms","abstract":"Having three or more specific risk factors, such as high blood pressure or abdominal fat, boosts your risk of type 2 diabetes and heart disease.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"MetabolicSyndromeSymptoms","container-title":"Mayo Clinic","language":"en","title":"Metabolic syndrome - Symptoms and causes","type":"webpage","URL":"https://www.mayoclinic.org/diseases-conditions/metabolic-syndrome/symptoms-causes/syc-20351916"},
  {"id":"millerProteinSynthesis2020","accessed":{"date-parts":[[2022,6,16]]},"author":[{"family":"Miller","given":"Christine"}],"citation-key":"millerProteinSynthesis2020","issued":{"date-parts":[[2020,9,1]]},"language":"en","publisher":"Thompson Rivers University","source":"humanbiology.pressbooks.tru.ca","title":"5.7 Protein Synthesis","type":"article-journal","URL":"https://humanbiology.pressbooks.tru.ca/chapter/5-6-protein-synthesis/"},
  {"id":"nathanTranslatingA1CAssay2008","abstract":"OBJECTIVE — The A1C assay, expressed as the percent of hemoglobin that is glycated, measures chronic glycemia and is widely used to judge the adequacy of diabetes treatment and adjust therapy. Day-to-day management is guided by self-monitoring of capillary glucose concentrations (milligrams per deciliter or millimoles per liter). We sought to deﬁne the mathematical relationship between A1C and average glucose (AG) levels and determine whether A1C could be expressed and reported as AG in the same units as used in self-monitoring. RESEARCH DESIGN AND METHODS — A total of 507 subjects, including 268 patients with type 1 diabetes, 159 with type 2 diabetes, and 80 nondiabetic subjects from 10 international centers, was included in the analyses. A1C levels obtained at the end of 3 months and measured in a central laboratory were compared with the AG levels during the previous 3 months. AG was calculated by combining weighted results from at least 2 days of continuous glucose monitoring performed four times, with seven-point daily self-monitoring of capillary (ﬁngerstick) glucose performed at least 3 days per week.\nRESULTS — Approximately 2,700 glucose values were obtained by each subject during 3 months. Linear regression analysis between the A1C and AG values provided the tightest correlations (AGmg/dl ϭ 28.7 ϫ A1C Ϫ 46.7, R2 ϭ 0.84, P Ͻ 0.0001), allowing calculation of an estimated average glucose (eAG) for A1C values. The linear regression equations did not differ signiﬁcantly across subgroups based on age, sex, diabetes type, race/ethnicity, or smoking status.\nCONCLUSIONS — A1C levels can be expressed as eAG for most patients with type 1 and type 2 diabetes.","accessed":{"date-parts":[[2022,4,27]]},"author":[{"family":"Nathan","given":"David M."},{"family":"Kuenen","given":"Judith"},{"family":"Borg","given":"Rikke"},{"family":"Zheng","given":"Hui"},{"family":"Schoenfeld","given":"David"},{"family":"Heine","given":"Robert J."},{"literal":"for the A1c-Derived Average Glucose (ADAG) Study Group"}],"citation-key":"nathanTranslatingA1CAssay2008","container-title":"Diabetes Care","DOI":"10.2337/dc08-0545","ISSN":"0149-5992, 1935-5548","issue":"8","issued":{"date-parts":[[2008,8,1]]},"language":"en","page":"1473-1478","source":"DOI.org (Crossref)","title":"Translating the A1C Assay Into Estimated Average Glucose Values","type":"article-journal","URL":"https://diabetesjournals.org/care/article/31/8/1473/28589/Translating-the-A1C-Assay-Into-Estimated-Average","volume":"31"},
  {"id":"OverviewCarbohydrateMetabolism","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"OverviewCarbohydrateMetabolism","title":"Overview of Carbohydrate Metabolism","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/600glycolysis.html"},
  {"id":"OverviewCitricAcid","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"OverviewCitricAcid","title":"Overview Citric Acid Cycle","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/610citricac.html"},
  {"id":"OverviewMetabolism","accessed":{"date-parts":[[2022,6,7]]},"citation-key":"OverviewMetabolism","title":"Overview Metabolism","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/5900verviewmet.html"},
  {"id":"OxidationReduction","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"OxidationReduction","title":"Oxidation and Reduction","type":"webpage","URL":"https://chemed.chem.purdue.edu/genchem/topicreview/bp/ch9/redox.php"},
  {"id":"Pancreas2022","abstract":"The pancreas is an organ of the digestive system and endocrine system of vertebrates. In humans, it is located in the abdomen behind the stomach and functions as a gland. The pancreas is a mixed or heterocrine gland, i.e. it has both an endocrine and a digestive exocrine function. 99% of the pancreas is exocrine and 1% is endocrine. As an endocrine gland, it functions mostly to regulate blood sugar levels, secreting the hormones insulin, glucagon, somatostatin, and pancreatic polypeptide. As a part of the digestive system, it functions as an exocrine gland secreting pancreatic juice into the duodenum through the pancreatic duct. This juice contains bicarbonate, which neutralizes acid entering the duodenum from the stomach; and digestive enzymes, which break down carbohydrates, proteins, and fats in food entering the duodenum from the stomach.\nInflammation of the pancreas is known as pancreatitis, with common causes including chronic alcohol use and gallstones. Because of its role in the regulation of blood sugar, the pancreas is also a key organ in diabetes mellitus. Pancreatic cancer can arise following chronic pancreatitis or due to other reasons, and carries a very poor prognosis, as it is often identified when it has spread to other areas of the body.\nThe word pancreas comes from the Greek πᾶν (pân, “all”) & κρέας (kréas, “flesh”). The function of the pancreas in diabetes has been known since at least 1889, with its role in insulin production identified in 1921.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"Pancreas2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,16]]},"language":"en","note":"Page Version ID: 1088127206","source":"Wikipedia","title":"Pancreas","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Pancreas&oldid=1088127206"},
  {"id":"PancreaticBud2022","abstract":"The ventral and dorsal pancreatic buds (or pancreatic diverticula) are outgrowths of the duodenum during human embryogenesis. They join to form the adult pancreas.\nThe proximal portion of the dorsal pancreatic bud gives rise to the accessory pancreatic duct, while the distal portion of the dorsal pancreatic bud and ventral pancreatic bud give rise to the major pancreatic duct.\nThe ventral pancreatic bud develops into the pancreatic head and uncinate process.","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"PancreaticBud2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,1,22]]},"language":"en","note":"Page Version ID: 1067165401","source":"Wikipedia","title":"Pancreatic bud","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Pancreatic_bud&oldid=1067165401"},
  {"id":"PancreaticBudOverview","accessed":{"date-parts":[[2022,6,5]]},"citation-key":"PancreaticBudOverview","title":"Pancreatic Bud - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/medicine-and-dentistry/pancreatic-bud"},
  {"id":"PhosphoricAcid2022","abstract":"Phosphoric acid (orthophosphoric acid, monophosphoric acid or phosphoric(V) acid) is an inorganic compound with the chemical formula H3PO4. Phosphoric acid is a colorless solid, it is commonly encountered as an 85% aqueous solution, which is a colourless, odourless, and non-volatile syrupy liquid. It is a major industrial chemical, being a component of many fertilizers.\nThe compound is an acid. Removal of all three H+ ions gives the phosphate ion PO3−4. Removal of one or two protons gives dihydrogen phosphate ion H2PO−4, and the hydrogen phosphate ion HPO2−4, respectively. Phosphoric acid forms esters, called organophosphates.The name \"orthophosphoric acid\" can be used to distinguish this specific acid from other \"phosphoric acids\", such as pyrophosphoric acid. Nevertheless, the term \"phosphoric acid\" often means this specific compound; and that is the current IUPAC nomenclature.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"PhosphoricAcid2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,30]]},"language":"en","note":"Page Version ID: 1090604545","source":"Wikipedia","title":"Phosphoric acid","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Phosphoric_acid&oldid=1090604545"},
  {"id":"ProteinBiosynthesis2022","abstract":"Protein biosynthesis (or protein synthesis) is a core biological process, occurring inside cells, balancing the loss of cellular proteins (via degradation or export) through the production of new proteins. Proteins perform a number of critical functions as enzymes, structural proteins or hormones. Protein synthesis is a very similar process for both prokaryotes and eukaryotes but there are some distinct differences.Protein synthesis can be divided broadly into two phases - transcription and translation. During transcription, a section of DNA encoding a protein, known as a gene, is converted into a template molecule called messenger RNA (mRNA). This conversion is carried out by enzymes, known as RNA polymerases, in the nucleus of the cell. In eukaryotes, this mRNA is initially produced in a premature form (pre-mRNA) which undergoes post-transcriptional modifications to produce mature mRNA. The mature mRNA is exported from the cell nucleus via nuclear pores to the cytoplasm of the cell for translation to occur. During translation, the mRNA is read by ribosomes which use the nucleotide sequence of the mRNA to determine the sequence of amino acids. The ribosomes catalyze the formation of covalent peptide bonds between the encoded amino acids to form a polypeptide chain.\nFollowing translation the polypeptide chain must fold to form a functional protein; for example, to function as an enzyme the polypeptide chain must fold correctly to produce a functional active site. In order to adopt a functional three-dimensional (3D) shape, the polypeptide chain must first form a series of smaller underlying structures called secondary structures. The polypeptide chain in these secondary structures then folds to produce the overall 3D tertiary structure. Once correctly folded, the protein can undergo further maturation through different post-translational modifications. Post-translational modifications can alter the protein's ability to function, where it is located within the cell (e.g. cytoplasm or nucleus) and the protein's ability to interact with other proteins.Protein biosynthesis has a key role in disease as changes and errors in this process, through underlying DNA mutations or protein misfolding, are often the underlying causes of a disease. DNA mutations change the subsequent mRNA sequence, which then alters the mRNA encoded amino acid sequence. Mutations can cause the polypeptide chain to be shorter by generating a stop sequence which causes early termination of translation. Alternatively, a mutation in the mRNA sequence changes the specific amino acid encoded at that position in the polypeptide chain. This amino acid change can impact the protein's ability to function or to fold correctly. Misfolded proteins are often implicated in disease as improperly folded proteins have a tendency to stick together to form dense protein clumps. These clumps are linked to a range of diseases, often neurological, including Alzheimer's disease and Parkinson's disease.","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ProteinBiosynthesis2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,5,24]]},"language":"en","note":"Page Version ID: 1089467579","source":"Wikipedia","title":"Protein biosynthesis","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Protein_biosynthesis&oldid=1089467579"},
  {"id":"ProteinMatabolism","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ProteinMatabolism","title":"Protein Matabolism","type":"webpage","URL":"http://chemistry.elmhurst.edu/vchembook/630proteinmet.html"},
  {"id":"ProteinSynthesisOverview","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"ProteinSynthesisOverview","title":"Protein Synthesis - an overview | ScienceDirect Topics","type":"webpage","URL":"https://www.sciencedirect.com/topics/medicine-and-dentistry/protein-synthesis"},
  {"id":"pustokhinaEffectiveTrainingScheme2020","abstract":"At present times, the real-time requirement on the multiaccess healthcare monitoring system, information mining, and efficient disease diagnosis of health conditions is a difficult process. The recent advances in information technology and the internet of medical things (IoMT) have fostered extensive utilization of the smart system. A complex, 24/7 healthcare service is needed for effective and trustworthy monitoring of patients on a daily basis. To accomplish this need, edge computing and cloud platforms are highly required to satisfy the requirements of smart healthcare systems. This paper presents a new effective training scheme for the deep neural network (DNN), called ETS-DNN model in edge computing enabled IoMT system. The proposed ETS-DNN intends to facilitate timely data collection and processing to make timely decisions using the patterns that exist in the data. Initially, the IoMT devices sense the patient's data and transfer the captured data to edge computing, which executes the ETS-DNN model to diagnose it. The proposed ETS-DNN model incorporates a Hybrid Modified Water Wave Optimization (HMWWO) technique to tune the parameters of the DNN structure, which comprises of several autoencoder layers cascaded to a softmax (SM) layer. The SM classification layer is placed at the end of the DNN to perform the classification task. The HMWWO algorithm integrates the MWWO technique with limited memory Broyden-Fletcher-Goldfarb-Shannon (L-BFGS). Once the ETS-DNN model generates the report in edge computing, then it will be sent to the cloud server, which is then forwarded to the healthcare professionals, hospital database, and concerned patients. The proposed ETS-DNN model intends to facilitate timely data collection and processing to identify the patterns exist in the data. An extensive set of experimental analysis takes place and the results are investigated under several aspects. The simulation outcome pointed out the superior characteristics of the ETS-DNN model over the compared methods.","author":[{"family":"Pustokhina","given":"Irina Valeryevna"},{"family":"Pustokhin","given":"Denis Alexandrovich"},{"family":"Gupta","given":"Deepak"},{"family":"Khanna","given":"Ashish"},{"family":"Shankar","given":"K."},{"family":"Nguyen","given":"Gia Nhu"}],"citation-key":"pustokhinaEffectiveTrainingScheme2020","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2020.3000322","ISSN":"2169-3536","issued":{"date-parts":[[2020]]},"page":"107112-107123","source":"IEEE Xplore","title":"An Effective Training Scheme for Deep Neural Network in Edge Computing Enabled Internet of Medical Things (IoMT) Systems","type":"article-journal","volume":"8"},
  {"id":"qiaoEffectiveDataPrivacy2019","abstract":"With the rapid development of information science and the Internet of Things (IoT), people have an unprecedented ability to collect and share data, especially the various sensors as the entrance to data collection. At the same time, edge computing has begun to grasp the public's attention because of the difficult challenges of massive equipment access and massive data. Although such large amount of data provides a huge opportunity for information discovery, the privacy leakage has also been concerned. When the data publisher publishes various statistics, the attacker can obtain the statistical rules in the data by simply using the query function without contacting the user or the data publisher. Therefore, how to protect the data privacy of statistical information has become the focus of attention. In this paper, we proposed a partitioned histogram data publishing algorithm based on wavelet transform. Firstly, a partitioning algorithm based on greedy algorithm is used to obtain a better partition structure. Then, we use wavelet transform to add noise. Finally, for the authenticity and usability of histogram, we get the reductive original histogram structure. On the one hand, our algorithm can reduce the complexity of wavelet tree constructed by wavelet transform. On the other hand, the query noise changes from linear growth to multiple logarithm growth. So the accuracy of histogram counting query is improved. Experiments show that our algorithm has the significant improvement in data availability.","author":[{"family":"Qiao","given":"Yi"},{"family":"Liu","given":"Zhaobin"},{"family":"Lv","given":"Haoze"},{"family":"Li","given":"Minghui"},{"family":"Huang","given":"Zhiyi"},{"family":"Li","given":"Zhiyang"},{"family":"Liu","given":"Weijiang"}],"citation-key":"qiaoEffectiveDataPrivacy2019","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2019.2939015","ISSN":"2169-3536","issued":{"date-parts":[[2019]]},"page":"136203-136213","source":"IEEE Xplore","title":"An Effective Data Privacy Protection Algorithm Based on Differential Privacy in Edge Computing","type":"article-journal","volume":"7"},
  {"id":"Redox2022","abstract":"Redox (reduction–oxidation,  RED-oks,  REE-doks) is a type of chemical reaction in which the oxidation states of substrate change.\nOxidation is the loss of electrons or an increase in the oxidation state of a chemical or atoms within it.\nReduction is the gain of electrons or a decrease in the oxidation state of a chemical or atoms within it.There are two classes of redox reactions: \n\nelectron-transfer where only one (usually) electron flows from the reducing agent to the oxidant. This type of redox reaction is often discussed in term of redox couples and electrode potentials.\natom transfer, where an atom transfers from one substrate to another.  For example, in the rusting of iron, the oxidation state of iron atoms increases as it converts to an oxide and simultaneously the oxidation state of oxygen decreases as it accepts electrons released by iron.  Although oxidation reactions are commonly associated with the formation of oxides, other chemical species can serve the same function. In hydrogenation, C=C (and other) bonds are reduced by transfer of hydrogen atoms.","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"Redox2022","container-title":"Wikipedia","issued":{"date-parts":[[2022,6,4]]},"language":"en","note":"Page Version ID: 1091527072","source":"Wikipedia","title":"Redox","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Redox&oldid=1091527072"},
  {"id":"songPredictingBloodGlucose2019","abstract":"Blood glucose monitoring is essential for diabetes management. Applying deep learning technique for blood glucose monitoring is promising, given its success in a range of healthcare and medical tasks. In this paper, we proposed a method that combines Empirical Mode Decomposition (EMD) with Long-Short Term Memory (LSTM) to achieve good experimental results in predicting patient blood glucose. We used patients' real blood glucose levels time series data to train the method proposed in this paper and to predict blood glucose for 30 minutes to 120 minutes. First, we use only blood glucose readings and timestamps in the dataset. Meanwhile, we used ADF to verify the non-stationarity of blood glucose time series. Then, we use EMD to decompose the blood glucose time series and use LSTM to train the decomposed time series to obtain a blood glucose prediction model. Finally, Mean Absolute Error (MAE) and root mean squared error (RMSE) were used to evaluate the experimental results. On the test dataset, the mean values of the MAE and RMSE are 0.4458mmol/L and 1.08mmol/L for 30mins, 0.87 and 1.27 mmol/L for 60mins, 0.85mmol/L and 1.36 mmol/L for 120mins, respectively. Experimental results show that the EMD+LSTM had better predictive performance than the LSTM when blood glucose changed dramatically. Meanwhile, it is still challenging to reach a high accuracy of predicting the long-term blood glucose.","author":[{"family":"Song","given":"Wei"},{"family":"Cai","given":"Wanyuan"},{"family":"Li","given":"Jing"},{"family":"Jiang","given":"Fusong"},{"family":"He","given":"Shengqi"}],"citation-key":"songPredictingBloodGlucose2019","container-title":"2019 6th International Conference on Systems and Informatics (ICSAI)","DOI":"10.1109/ICSAI48974.2019.9010318","event":"2019 6th International Conference on Systems and Informatics (ICSAI)","issued":{"date-parts":[[2019,11]]},"page":"1443-1448","source":"IEEE Xplore","title":"Predicting Blood Glucose Levels with EMD and LSTM Based CGM Data","type":"paper-conference"},
  {"id":"StorageProtein2020","abstract":"Storage proteins serve as biological reserves of metal ions and amino acids, used by organisms. They are found in plant seeds, egg whites, and milk.\nFerritin is an example of a storage protein that stores iron. Iron is a component of heme, which is contained in the transport protein, hemoglobin and in cytochromes.\nSome storage proteins store amino acids. Storage proteins' amino acids are used in embryonic development of animals or plants. Two amino acid storage proteins in animals are casein and ovalbumin.\nSeeds, particularly of leguminous plants, contain high concentrations of storage proteins. Up to 25 percent of the dry weight of the seed can be composed of storage proteins. The best known storage protein in wheat is the prolamin gliadin, a component of gluten.","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"StorageProtein2020","container-title":"Wikipedia","issued":{"date-parts":[[2020,10,20]]},"language":"en","note":"Page Version ID: 984468213","source":"Wikipedia","title":"Storage protein","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Storage_protein&oldid=984468213"},
  {"id":"StructuralBiochemistryEnzyme","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"StructuralBiochemistryEnzyme","language":"en","title":"Structural Biochemistry/Enzyme Catalytic Mechanism/Protein Function - Wikibooks, open books for an open world","type":"webpage","URL":"https://en.wikibooks.org/wiki/Structural_Biochemistry/Enzyme_Catalytic_Mechanism/Protein_Function"},
  {"id":"StructuralProteinFunction","abstract":"JoVE publishes peer-reviewed scientific video protocols to accelerate biological, medical, chemical and physical research. Watch our scientific video articles.","accessed":{"date-parts":[[2022,6,16]]},"citation-key":"StructuralProteinFunction","language":"en","title":"Structural Protein Function: Collagen, Actin, Myosin and Keratin | Molecular Biology | JoVE","title-short":"Structural Protein Function","type":"webpage","URL":"https://www.jove.com/science-education/11524/structural-protein-function"},
  {"id":"wangBloodGlucosePrediction2020","abstract":"The time series of blood glucose concentration in diabetics are time-varying, nonlinear and non-stationary. To improve the accuracy of blood glucose prediction, a short-term blood glucose prediction model (VMD-IPSO-LSTM) combining variational modal decomposition (VDM) and improved Particle swarm optimization optimizing Long short-term memory network (IPSO-LSTM) was proposed. Firstly, the time series of blood glucose concentration of patients was decomposed by using VMD method to obtain the intrinsic modal functions (IMF) of blood glucose components in different frequency bands, so as to reduce the non-stationarity of blood glucose time series. Then a prediction model was established for each blood glucose component IMF by using the long and short time memory network. Since the number of neurons, learning rate and time window length of LSTM are difficult to determine, the improved PSO algorithm is used to optimize these parameters. The optimized LSTM network was used to predict each IMF, and finally the predicted subsequence was superimposed to obtain the final prediction result. The data of 56 patients were selected as experimental data from 451 patients with diabetes mellitus. The experimental results showed that the proposed VMD-IPSO-LSTM model could achieve high prediction accuracy at 30min, 45min and 60min in advance. When predicted 60 minutes in advance, compared with the LSTM, VMD-LSTM and VMD-PSO-LSTM methods, the RMSE of proposed method decreased by 15.565,3.402,1.215 and the MAPE of proposed method decreased by 11.284%,2.024%, 0.834%, and the percentage of predicted values falling into the A zone increased by 23.5%,6.1% and 2.8% in the Clarke error grid, respectively. The improved accuracy of blood glucose prediction and longer prediction time can provide sufficient time for physicians and patients to control blood glucose concentrations and improve the effectiveness of diabetes treatment.","author":[{"family":"Wang","given":"Wenbo"},{"family":"Tong","given":"Meng"},{"family":"Yu","given":"Min"}],"citation-key":"wangBloodGlucosePrediction2020","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2020.3041355","ISSN":"2169-3536","issued":{"date-parts":[[2020]]},"page":"217908-217916","source":"IEEE Xplore","title":"Blood Glucose Prediction With VMD and LSTM Optimized by Improved Particle Swarm Optimization","type":"article-journal","volume":"8"},
  {"id":"WhatAreDehydration","accessed":{"date-parts":[[2022,6,6]]},"citation-key":"WhatAreDehydration","title":"What are dehydration of alcohol? Definition, Types and Importance - chemistry | AESL","type":"webpage","URL":"https://www.aakash.ac.in/important-concepts/chemistry/dehydration-of-alcohol"},
  {"id":"xieBenchmarkingMachineLearning2020","abstract":"Objective: \nThis paper aims to compare the performance of several commonly known machine-learning (ML) models versus a classic Autoregression with Exogenous inputs (ARX) model in the prediction of blood glucose (BG) levels using time-series data of patients with Type 1 diabetes (T1D).\n\nMethods:\nThe ML algorithms include ML-based regression models and deep learning models such as a vanilla Long-Short-Term-Memory (LSTM) Network and a Temporal Convolution Network (TCN). Evaluations have been conducted with respect to different input features, regression model orders, as well as using the recursive method or direct method for multi-step prediction of BG levels. Prediction performance metrics include the average Root Mean Square Error (RMSE), temporal gain (TG) for early prediction, and the normalized energy of the second-order differences (ESOD) of the predicted time series for reflecting risk of false alerts on hypo/hyper glycemia events.\n\nResults:\nThe ARX model achieved the lowest average RMSE for both recursive and direct methods, the second highest average TG under the direct method, but with a higher average normalized ESOD than some other models.\n\nConclusion:\nThere was no significant advantage observed from the ML models compared to the classic ARX model in predicting BG levels for T1D, except that TCN's performance was more robust with respect to BG trajectories with spurious oscillations, for which ARX tended to over-predict peak BG values and under-predict valley BG values.\n\nSignificance:\nInsight learned from this study could help researchers and clinical practitioners to select appropriate models for BG prediction.","author":[{"family":"Xie","given":"Jinyu"},{"family":"Wang","given":"Qian"}],"citation-key":"xieBenchmarkingMachineLearning2020","container-title":"IEEE Transactions on Biomedical Engineering","container-title-short":"IEEE Transactions on Biomedical Engineering","DOI":"10.1109/TBME.2020.2975959","issued":{"date-parts":[[2020,2,17]]},"source":"ResearchGate","title":"Benchmarking Machine Learning Algorithms on Blood Glucose Prediction for Type I Diabetes in Comparison With Classical Time-Series Models","type":"article-journal","volume":"PP"}
]
